const SNKCourseQuestions = [
    {
        level: "SNK",
        question: "দিনের বেলা আক্রমণের বিন্যাস পাশাপাশি সেকশনের মধ্যবর্তী দূরত্ব কত গজ।",
        options: ["২৫ গজ।", "৫০ গজ।", "৫৫ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এফএসলন গাড়ীতে কি থাকে।",
        options: ["প্রথম সারির রিজার্ভ এ্যামোঃ", "খাবার।", "৫৫ গজ।", "৭৫-১০০ গজ।"], 
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণে এফএসলন নেতৃত্বে কে থাকে?",
        options: ["সিএসএম।", "সিকিউএমএস।", "বিকিউএমএস।", "কোত এনসিও।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "নিরাপত্তা সেকশন অধিনায়ক কত গজের মধ্যে ২/৩ টি ক্ষুদ্র রণকৌশলগত গুরুত্বপূর্ণ ভূমি দখলের মাধ্যমে বিন্যাস ভূমির নিরাপত্তা নিশ্চিত করেন।",
        options: ["১০০-২০০ গজ।", "২০০-৩০০ গজ।", "৩০০-৪০০ গজ।", "৪০০-৫০০ গজ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে রেকী সাধারণত কিসের উপর করা হয়।",
        options: ["ভূমি।", "স্কেচ।", "ম্যাপ।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে একটি পদাতিক ব্যাটালিয়নের জন্য যাত্রাস্থলের নিরাপত্তার দায়িত্বে কে থাকে।",
        options: ["১টি গভীরের কোম্পানী।", "১টি গভীরের কোম্পানী ১টি গভীরের প্লাটুন।", "১টি অনুসরণকারী সেকশন।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে রণকৌশলগত গুরুত্বপূর্ণ ভূমি দখলে নেওয়া কার কাজ।",
        options: ["মোবাইল ট্রুপস্", "প্লাংক গার্ড।", "ভ্যান গার্ড।", "এ্যাডভান্স গার্ড।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে উভয় পাশের তল্লাশি বিস্তৃতি কত গজ?",
        options: ["১৫০-৩০০ গজ।", "২০০-৩০০ গজ।", "১৫০-২৫০ গজ।", "২৫০-৩০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে অক্ষে স্কাউটগণ পয়েন্ট সেকশন হতে কতগজ আগে চলে।",
        options: ["৭৫-১৫০ গজ।", "৭৫-১০০ গজ।", "১৫০-২৫০ গজ।", "২৫০-৩০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতের আক্রমণে একটি প্লাটুনের বিস্তৃতি কত গজ?",
        options: ["২৫-৩০ গজ।", "৫০-১০০ গজ।", "৫৫-১০০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোম্পানী পর্যায়ে বিন্যাস ভূমি চিহ্নিত করণ দলের জনবল কতজন?",
        options: ["০৮ জন।", "২৮ জন।", "১২ জন।", "১৬ জন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চূড়ান্ত মিলনস্থানে সর্বপ্রথম কোন দল যাত্রা করবে।",
        options: ["বিচ্ছিন্নকারী দল", "আবরণী দল।", "সংরক্ষিত দল।", "কার্যকরী দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন চিকিৎসার সহায়তার জন্য দায়িত্ব প্রাপ্ত থাকে।",
        options: ["এডিএস।", "এমডিএস", "মেডিক্যাল ইউনিট।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন দলের কমান্ডার হিসেবে থাকেন।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কাট-আপ পার্টি", "এ্যাকশন পার্টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণকারী সেনা দলের সহায়তার জন্য বিন্যাস ভূমি থেকে কত ডিড্রী কোণে ফায়ার বেস স্থাপনা করা হয়।",
        options: ["৪৫ ডিগ্রী।", "৯০ ডিগ্রী।", "৮০ ডিগ্রী।", "কোনটিই নয়।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "যদি পর্যাপ্ত ফায়ার সমর্থন এবং ভূমি আকস্মিকতা অর্জনের সহায়তা করে তবে এই আক্রমণ পরিচালনা করা যাবে।",
        options: ["স্বশব্দ আক্রমণ।", "নিঃ শব্দে আক্রমণ", "দ্বিতীয় আক্রমণ", "ভোরের আক্রমণ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ধ্বংসাত্বক পর্বে প্লাটুন ও সেকশনের স্তরে কয়টি মূলনীতি রয়েছে।",
        options: ["০৩ টি।", "০৫ টি।", "০৭ টি।", "০৯ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের দল বিন্যাসের ভারসাম্যতা বজায় রাখার জন্য দলবিন্যাস নিম্নের কোন বিষয়ের উপর নির্ভরশীল নয়।",
        options: ["উদ্দেশ্য।", "মনোবল", "ভূমির অবস্থা।", "শত্রুর বাধার ক্ষমতা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আরপি সেকশনের লোক নিয়োগ কে করে থাকে।",
        options: ["অধিনায়ক", "এ্যাডজুটেন্ট", "উপ-অধিনায়ক", "নিরাপত্তা অফিসার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিনের বেলা আক্রমণে বিন্যাস ভূমিতে পাশাপাশি সেকশনের মধ্যবর্তী দূরত্ব কত।",
        options: ["২৫ গজ।", "৫০ গজ।", "৫৫ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোম্পানী পর্যায়ে বিন্যাস ভূমি চিহ্নিত করণ দলের সংগঠন।",
        options: ["২৮ জন।", "১২ জন।", "০৮ জন।", "১৬ জন।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতে আক্রমণে একটি প্লাটুনের বিন্যাস ভূমির বিস্তৃতি।",
        options: ["২৫-৩০ গজ।", "৫০-১০০ গজ।", "৫৫-১০০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণে সময় কেউ হতাহত হলে সেখান থেকে সংগ্রহ করে কে?",
        options: ["সিকিউএমএস", "আক্রমণের সময়", "আক্রমণের পর", "অনুসরণকারী দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘকালীন হানার লক্ষ্যবস্তু কোনটি।",
        options: ["প্রধান কার্যলয়।", "টেলিফোন।", "যুদ্ধবন্দী।", "বিদুৎ শক্তি উৎপাদন কেন্দ্র।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্বল্পকালীন হানার লক্ষবস্তু কোনটি।",
        options: ["সেতু।", "রেল যোগাযোগ ব্যবস্থা।", "শত্রুর গান পজিশন।", "বিদুৎ শক্তি উৎপাদন কেন্দ্র।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চুড়ান্ত মিলনস্থান সর্ব প্রথম কোন দল যাত্রা করবে।",
        options: ["বিচ্ছিন্নকারী দল।", "আবরণী দল।", "কার্যকরী দল।", "সবচেয়ে দূরের দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর সম্ভাব্য পথ, শত্রুর অভ্যাস এবং শত্রু দ্বারা সৃষ্ট শব্দ নিরীক্ষণ করা কোন টহলের কাজ।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ", "জংগী।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন পার্টি কমান্ডার হিসেবে কাজ করে।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কার্ট আপ পার্টি।", "এ্যাকশন পার্টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সতর্কতা হানার কোন বিষয়ক সহায়ক।",
        options: ["আকস্মিকতা", "নিয়ন্ত্রণ।", "মনোবল।", "নিরাপত্তা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্টফ ফায়ার আদেশের সাথে সাথে হোল্ডিং পার্টি বিশ্রাম এলাকা ফায়ার",
        options: ["চালিয়ে যাবে", "বন্ধ রাখবে", "এ্যাকশন পার্টির সাথে মিশে যাবে", "কোনটিই নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এয়ার ফটোকে সাধারণত কয় শ্রেণীতে ভাগ কর যায়।",
        options: ["১", "২", "৩", "৪"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রবল বাতাস চেনার উপায় কোনটি।",
        options: ["৬ হতে ১০ মিটার।", "৮ হতে ১২ মিটার।", "৪ হতে ১২ মিটার।", "৮ হতে ১০ মিটার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যম বাতাস চেনার উপায় হলো প্রতি সেকেন্ডে বাতাসের গতি কত।",
        options: ["৬ হতে ১০ মিটার।", "৮ হতে ১২ মিটার।", "৪ হতে ৭ মিটার।", "৮ হতে ১১ মিটার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দুষিত এলাকায় চিহ্নিত করণে কি রং ব্যবহার করা হয়।",
        options: ["লাল", "হলুদ", "সাদা", "কালো"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সঠিক দূরত্ব নির্ণয়ের সুবিধার্থে দায়িত্বপূর্ণ এলাকাকে মোট কয়টি অংশে ভাগ করা হয়।",
        options: ["২", "৪", "৫", "৩"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর সম্ভাব্য আগমণের নজর রাখা কোন টহলের কাজ।",
        options: ["স্থির ওপি প্রদান করে।", "দন্ডায়মান টহল", "পর্যবেক্ষণ চৌকি।", "দৃশ্যমান স্থান।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা পরিচালনার জন্য কার্যকরী দল কয়টি উপদলের সমন্বয়ে গঠিত হয়।",
        options: ["৪টি।", "৫টি।", "৩টি।", "৬টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের সময় সকল অস্ত্রের পাল্লা কত লাগাতে হবে।",
        options: ["৩০০ গজ।", "২০০ গজ।", "৫০০ গজ।", "১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শহর এলাকার আক্রমণকে কয়টি পর্বে ভাগ করা যেতে পারে।",
        options: ["৩", "৪", "৬", "২"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অনুপবেশ কয়টি উপায়ে করা যায়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিনের ফাঁদে নির্ভরশীল হিসাবে কী নিয়োগ করা যেতে পারে।",
        options: ["স্নাইপার।", "রাইফেল।", "এলএমজি।", "মর্টার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার সংবাদ সংগ্রহের মাধ্যমে কোনটি।",
        options: ["মানচিত্র", "এয়ার ফটো।", "যুদ্ধবন্দী।", "উপরের সবগুলি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "নিরাপদ চিহ্ন গুপ্তাশ্রয় হতে কত দূরত্বে স্থাপন করা হয়।",
        options: ["৩০০ গজ।", "৫০০ গজ।", "৩০০-৪০০ গজ।", "৩০০-৫০০ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যমা আঙ্গুল থেকে কনিষ্ট আঙ্গুল পর্যন্ত কত ডিগ্রি।",
        options: ["৫", "৩", "২", "৭"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এ্যাগবাটিসের (গাছের একাংশ ফেলে) মাধ্যমে সৃষ্ট সড়ক প্রতিবন্ধকতা কত ডিগ্রি কোনে শত্রুর আগমনী পথ স্থাপন করা হয়।",
        options: ["৫০ ডিগ্রি।", "৪৫ ডিগ্রি।", "৬০ ডিগ্রি।", "৯০ ডিগ্রি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুন মোতায়েন নিরাপত্তা দলের অংশ নয় কোনটি।",
        options: ["আবরণী দল।", "পশ্চাৎ দল।", "পার্শ্বরক্ষীদল।", "পরিকল্পনা দল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রভিযানে প্লাটুন সদরে আহতদের প্রয়োজনীয় চিকিৎসা প্রদানের পর কোথায় পৌছানো হয়।",
        options: ["এমডিএস।", "সি এশিএ", "এডিএস", "সিএমএইচ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণকারী সেনাদলের সহায়তার জন্য বিন্যাসভূমি হতে কত ডিগ্রি কোণে ফায়ার বেস স্থাপন করা হয়।",
        options: ["৪৫ ডিগ্রি।", "৬০ ডিগ্রি।", "১৮০ ডিগ্রি।", "৯০ ডিগ্রি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতের আক্রমণে বিন্যাস ভূমিতে ব্যক্তি হতে ব্যক্তির দূরত্ব কত হবে।",
        options: ["৩-৫ গজ।", "২-৪ গজ।", "৪-৫ গজ।", "২-৩ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিবা আক্রমণে বিন্যাস ভূমিতে ব্যক্তি থেকে ব্যক্তির দূরত্ব কত হবে।",
        options: ["২-৩ গজ।", "২-৩ মিটার।", "৪-৫ গজ।", "৫ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের সময় শত্রু গোলাগুলি করতে শুরু করলে সাধারণত কেউ কত গজের বেশী দৌড়াবেনা।",
        options: ["৫ গজ।", "১ গজ।", "১৫ গজ।", "২০ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণের সময় মাইন ফিল্ডের মধ্যে দিয়ে অতিক্রম করার সময় শতকরা কত ভাগ হতাহত সম্ভাবনা থাকে।",
        options: ["২০ শতাংশ", "১০ শতাংশ", "৫ শতাংশ", "৩০ শতাংশ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সেকশন অধিনায়কে কয়টি বিষয়ে পারদর্শী হতে হবে।",
        options: ["৫টি।", "৩টি।", "৪টি।", "৬টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহলের উদ্দেশ্য কয়টি।",
        options: ["৪টি।", "৫টি।", "৬টি।", "৭টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহল কত প্রকার।",
        options: ["৩ প্রকার।", "১ প্রকার।", "৪ প্রকার", "২ প্রকার।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "লক্ষ্যবস্তুর উপর ভিত্তি করে কয় প্রকারে পর্যবেক্ষণ সম্পাদন করা হয়ে থাকে।",
        options: ["২ প্রকার।", "৩ প্রকার।", "৪ প্রকার", "৫ প্রকার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা কার্য সম্পাদান করা কোন টহলের কাজ।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ", "জংগীটহল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহলের পর্ব কয়টি।",
        options: ["৩টি।", "৪টি।", "৫টি।", "৬টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কয়টি বিশেষ উপাদানের উপর নির্ভর করে ফর্মশকে মেনে চলতে হবে।",
        options: ["৪টি", "৫টি।", "৬টি", "৭টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কয়টি বিশেষ উপাদানের উপর নির্ভর করে ফর্মশকে মেনে চলতে হবে।",
        options: ["৪টি", "৫টি", "৬ টি", "৭ টি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চুড়ান্ত মিলনস্থান পৌঁছার কত গজ পূর্বে মূল দলকে স্বল্পকালীন বিরতির সংকেত দিতে হবে।",
        options: ["৩০০ গজ।", "২০০ গজ।", "৪০০ গজ।", "৫০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অধিনায়ক তার অপারেটরসহ চূড়ান্ত মিলনস্থান থেকে কত গজ দূরে অবস্থান করবে।",
        options: ["৫০-১০০ গজ।", "৭০-১০০ গজ।", "৫০-৮০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জটিল পদ্ধতি লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৩ টি।", "৪ টি।", "৫ টি।", "৬ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা কার্যক্রম সাধারণত কতক্ষণ।",
        options: ["৪-৫ মিনিট।", "৩-৪ মিনিট।", "৫-৬ মিনিট।", "২-৩ মিনিট স্থায়ী হয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সেকশন ব্যাটেল ড্রিল।",
        options: ["৪ টি।", "৩ টি।", "৫ টি।", "৬ টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সময়ের উপর ভিত্তি করে আক্রমণ কত প্রকার।",
        options: ["৪ প্রকার।", "৩ প্রকার।", "৫ প্রকার।", "৬ প্রকার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৩টি।", "২টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জটিল পদ্ধতিতে লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৫ টি।", "৪ টি।", "৩ টি।", "৬ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় এফডিএল থেকে আহত সৈনিককে সিএপিতে নিয়ে আসা কার কাজ।",
        options: ["প্লাটুন কমান্ডার।", "কোম্পানী এস জেসিও।", "সেকশন কমান্ডার।", "প্লাটুন সার্জেন্ট।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় এমজি এবং আর আর অবস্থান কে নির্ধারণ করবে।",
        options: ["প্লাটুন কমান্ডার।", "কোম্পানী কমান্ডার।", "ব্যাটালিয়ন কমান্ডার।", "ব্রিগেড কমান্ডার।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় শত্রুর শেল বা গুলি লাগলে সাথে সাথে কি করতে হবে।",
        options: ["আরএপিতে নিতে হবে।", "মেল ড্রেসিং/ফিল্ড ড্রেসিং দিতে হবে।", "মরফিয়া দিতে হবে।", "সিএপিতে পাঠাতে হবে।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "বস্তু খো যাওয়ার কারণ কয়টি।",
        options: ["৭টি।", "৫টি।", "৬টি।", "৮টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সঠিক দূরত্ব নির্ণয়ের সুবিধার্থে দায়িত্বপূর্ণ এলাকাকে কয়টি ভাগে ভাগ করা হয়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফাঁদের লুক আউটম্যানের কাজ কয়টি।",
        options: ["৩টি।", "৪টি।", "৫টি।", "৬টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শ্রবণ চৌকির জনবল সাধারণ।",
        options: ["২-৩ জন।", "১-২ জন।", "৩-৪ জন।", "৪-৫ জন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘ কালীন হানার লক্ষবস্তু কয়টি?",
        options: ["৫টি।", "৬টি।", "৭টি।", "৮টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যখানের ভূমি কত মিটার?",
        options: ["৩০০-৫০০", "৩০০-৪০০", "৪০০-৫০০", "২০০-৩০০"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাস্তা অতিক্রমে ব্যবহার করা হয়।",
        options: ["বানর চাল।", "চিতা চাল।", "গড়ান চাল।", "হাঁটা চাল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফাঁদ এলাকা হতে লুক আউটম্যানের অবস্থান।",
        options: ["২ কিঃ মিঃ।", "৩ কিঃ মিঃ।", "২-৩ কিঃ মিঃ।", "৪ কিঃ মিঃ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর অবস্থান নির্ণয় করার পদ্ধতি কয়টি।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফার্মবসে বা শক্ত ঘাটির দল।",
        options: ["৩", "৪", "৬", "২"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণের পর্ব কয়টি।",
        options: ["২ টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "তর্জনী থেকে মধ্যমা আঙ্গুল কত ডিগ্রি?",
        options: ["২ ডিগ্রী।", "৩ ডিগ্রী।", "৪ ডিগ্রী।", "৫ ডিগ্রী।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন বাস্তাবায়নে ধাপ কয়টি।",
        options: ["২টি।", "৬টি।", "৩টি।", "৫টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষা একটি প্লাটুনের গভীরতা কত মিটার?",
        options: ["১০০ মিটার।", "২০০ মিটার।", "৩০০ মিটার।", "৪০০ মিটার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রু পাল্টা ফাঁদ প্রতিহত করা কোন দলের কাজ।",
        options: ["বিচ্ছিন্নকারী দল।", "আবরণী দল।", "প্রধান দল।", "সংরক্ষিত দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আলোতে নিজস্ব প্রতিরক্ষায় অথবা মাইনফিল্ড পরিখা করা।",
        options: ["প্রথম এবং শেষ।", "দ্বিতীয় এবং চতুর্থ।", "প্রথম এবং চতুর্থ।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চৌকস সেনাদল কতটি ফিল্ড সংকেত ব্যবহার করা যাবে।",
        options: ["০৫", "০৭", "০৪", "০৩"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কতো মিটার দূরের সৈনিকের চেহারা অন্ধকারে দেখা যায়।",
        options: ["৫০০", "৩০০", "৮০০", "৯০০"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে পয়েন্ট সেকশন তল্লাশি বিস্তৃতি কত গজ।",
        options: ["২০০-৫০০ গজ।", "১০০-৩০০ গজ।", "১৫০-৩০০ গজ।", "৩০০-৫০০ গজ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জলাধারে নিকট কখন কী করা উচিত না।",
        options: ["ভীড়।", "কাছাকাছি যাওয়া।", "বসে থাকা।", "ধাকাধাকি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর গান পজিশন কী হানার লক্ষ্যবস্তু।",
        options: ["দীর্ঘকালীন হানা।", "স্বল্পকালীন হানা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চূড়ান্ত মিলনস্থানে পৌঁছার কত গজ পূর্বে মূলদলকে বিরতী সংকেত দিক।",
        options: ["৫০০", "৩০০", "৪০০", "২০০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফায়ার নিয়ন্ত্রণ আদেশ পর্যায়ক্রমে ইংরেজীতে কী ওয়ার্ড।",
        options: ["GRLT", "GRIT", "CLAP", "GPLT"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষা একটি প্লাটুনের বিস্তৃতি কতো মিটার।",
        options: ["৫০০ মিটার।", "৪০০ মিটার।", "৩০০ মিটার।", "২০০ মিটার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "গুপ্তাশ্রয় শত্রুর অবস্থান থেকে কত মাইন দূরে হওয়া ভালো।",
        options: ["৩ মাইল", "৫ মাইল।", "৪ মাইল।", "৬ মাইল।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হাত অথবা হাটুর সাহায্যে কি চাল ব্যবহার করা যায়।",
        options: ["বানর।", "হাটা।", "চিতা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কত মিটার দূরের সৈনিকের চেহারা চেনা মুসকিল।",
        options: ["৫০০ মিটার।", "৪০০ মিটার।", "২০০ মিটার।", "১০০ মিটার।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রহরী সাথে যোগাযোগ এর মাধ্যম কয়টি?",
        options: ["৬টি।", "৮টি।", "৩টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পর্যবেক্ষণ শ্রবণ চৌকির দায়িত্ব ও কর্তব্যগুলি কয়টি?",
        options: ["৫ টি", "৮টি।", "৪টি।", "২টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সময় ওপর ভিত্তি করে আক্রমণ কত প্রকার।",
        options: ["২ প্রকার।", "৩ প্রকার।", "৪ প্রকার।", "৫ প্রকার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা শেষে কয়টি বিষয় প্রতিবেদন দেওয়া হয়।",
        options: ["৮ টি।", "৭টি।", "৬টি।", "৯টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্কাউট এর দায়িত্ব কর্তব্য কয়টি?",
        options: ["৬টি।", "৭টি।", "৮টি।", "৯টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহল সংগঠন প্রভাব বিস্তার উপাদান কয়টি।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সংকেত কয়ভাবে দেওয়া যায়।",
        options: ["৩", "৫", "৮", "৯"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন সবসময় কিসের আশংকা থাকে।",
        options: ["জংঙ্গী টহল।", "অনুপ্রবেশ।", "আক্রমণের।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুণঃমোতায়েন রিলিজ পয়েন্ট স্থাপনের কোন দলের কাজ।",
        options: ["পর্যবেক্ষণ দল।", "নিরাপত্তা দল।", "পশ্চাদ দল।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন পার্টির কমান্ডার হিসাবে থাকেন।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কাট আপ পার্টি।", "এ্যাকশন পার্টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোন টহল গোপনে সংবাদ গ্রহণ করে।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ।", "জংঙ্গী।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘকালীন হানার লক্ষবস্তু কোনটি।",
        options: ["গোয়েন্দা সংস্থা।", "বিদ্যুৎ শক্তি উৎপাদান কেন্দ্র।", "আরআর স্টেশন।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা পরিচালনা পূর্বে সংবাদ সংগ্রহ উৎস কয়টি?",
        options: ["৩টি।", "৪টি।", "৫টি।", "৮টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "তর্জনী আঙ্গুল থেকে মধ্যমা আঙ্গুল পর্যন্ত কত ডিগ্রি।",
        options: ["২", "৩", "৪", "৫"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ছাড়শব্দের কয়টি অংশ থাকে।",
        options: ["২", "৪", "৬", "৫"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কত মিটার দূরের সৈনিক এর মাথা ইংরেজী ফুলস্টফ এর মতো দেখা যায়।",
        options: ["৫০০", "৬০০", "৭০০", "৮০০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফিল্ড সিগন্যাল কয়টি জিনিসের মাধ্যমে দেয়া হয়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফায়ার অবস্থান ঠিক করার জন্য কোনটি সম্পর্কে জ্ঞান থাক দরকার।",
        options: ["অস্ত্রের বৈশিষ্ট্য।", "ভূমির ব্যবহার।", "আবহাওয়া।", "কওখ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পার্বত্য চট্টগ্রাম কত সালে শান্তি চুক্তি স্বাক্ষরিত হয়।",
        options: ["১৯৯১।", "১৯৯৬।", "১৯৯৭।", "১৯৯৮।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পাঁচ সেকেন্ড ব্যবধানে দুইটি লম্বা বাঁশি কিসের সংকেত।",
        options: ["শত্রুর বিমান আক্রমণ শেষ।", "ভূমিতে নামা।", "শত্রুর বিমান।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হাত খুলে তালু নীচের দিকে রেখে দুই বা তিনবার উঠা নামা করা কিসের সংকেত।",
        options: ["থামা।", "তাড়াতাড়ি কর।", "শায়িত অবস্থায় যাও।", "লাইন কর।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোনগুলো অস্থায়ী সড়ক প্রতিবন্ধকতা।",
        options: ["কংক্রিট সিলিন্ডার।", "ভাটিক্যাল রেল।", "বেল্টরেল।", "উপরের সবগুলো।"],
        correct: 3,
        explanation: ""
    }
];

const NCOCourseQuestions = [
    {
        level: "NCO",
        question: "মূল প্রতিরক্ষায় প্লাটুনের কাজ নয় কোনটি?",
        options: ["খনন করা", "সেকশন অধিনায়কের পায়া নির্দেশিকা তৈরি করা", "যোগাযোগ স্থাপন করা", "মাইন লাগানো"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যে অবস্থান থেকে অস্ত্র ফায়ার করার সময় শত্রু ফায়ার হতে আড় পায়া এবং নিরাপদ থাকে তাকে কি অবস্থান বলে?",
        options: ["এনফিলেড", "বিচ্ছুরণ", "ডেফিলেটেড", "কোনটিই নয়"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষা এসটিএলএ এফ অংগ নষ্ট হয়ে গেলে প্লাটুন অধিনায়কের এর কর্তব্য কি?",
        options: ["গভীরের সেকশন থেকে অস্ত্র এনে ঐ স্থানে স্থাপন করা", "কোম্পানী অধিনায়কের আদেশের জন্য অপেক্ষা করা", "উপরের সবগুলো", "কোনটিই নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্লাটুন সদরের টেলিফোনে সব সময় লোক রাখতে হয়। ইহা নিশ্চিত করা কার কাজ?",
        options: ["প্লাটুন সার্জেন্টের", "প্লাটুন কমান্ডারের", "সেকশন কমান্ডারের", "উপরের সবগুলো"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষায় নিরাপত্তামূলক বা রক্ষাকারী অপনল (Protective Detachment) নয় কোনটি?",
        options: ["পর্যবেক্ষণ দল", "সংরক্ষিত দল", "অগ্রবর্তী অবস্থান", "পল্ট"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষার সমাগম এলাকায় প্লাটুন সার্জেন্টের ব্রীফিং এ সমান্য নির্দেশাবলী তে কোন বিষয়টি উল্লেখ করতে হয়?",
        options: ["প্রতিরক্ষা অবস্থান গ্রহণের সময়", "প্রতিরক্ষা অবস্থান শেষ করার সময়", "ওপি পাঠানোর সময়", "ক ও খ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষার ক্ষেত্রে, নিচের কোনটি সবচেয়ে ছোট সংগঠন যা একটি চতুর্মুখী প্রতিরক্ষা নিতে পারে?",
        options: ["সেকশন", "প্লাটুন", "কোম্পানী", "কোনটি নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্লাটুন অধিনায়কের দেয়া সময় ও স্থান অনুযায়ী প্লাটুন অদেশ দলের যখন নিশ্চিত করা কার দায়িত্ব?",
        options: ["সেকশন অধিনায়ক", "প্লাটুন সার্জেন্ট", "আর এল মাল", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রচণাত্মক যুদ্ধ কয়টি পর্যায়ে সম্পন্ন হয়?",
        options: ["৪ টি", "৩ টি", "৬ টি", "২ টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রচণাত্মক ফায়ার তলব করতে হলে নিম্নলিখিত কোন তথ্যটি দিতে হবে না?",
        options: ["শত্রু সংখ্যা", "শত্রুর অবস্থান, একটি গ্রিড সূত্র", "শত্রু কি করছে", "কখন তাদের দেখা গেছে"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষায় একটি সেকশনের বিকল্প অবস্থান মূল অবস্থান হতে সাধারণত কত দূরত্বে হওয়া উচিত?",
        options: ["২০০-৩০০ গজ", "২৫০-৩৫০ গজ", "১৫০-২০০ গজ", "৩০০-৪০০ গজ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যে ফায়ারের বিটোন জোন এবং শসসেনার অক্ষ মিলে যায় তাকে কি বলে?",
        options: ["এনফিলেড ফায়ার", "ডেফিলেটেড অবস্থান", "প্রতিছেদ রেখা", "পাল্টা আক্রমণ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রস্তুতি অনুসারে শত্রুর সংস্পর্শে না থাকলে নিজ পছন্দমতো স্থানে প্রস্তুত করা প্রতিরক্ষা অবস্থানকে কি বলা হয়?",
        options: ["তড়িৎ প্রতিরক্ষা", "সুপরিকল্পিত প্রতিরক্ষা", "সংগঠিত চতুর্মুখী প্রতিরক্ষা", "অবস্থিত চতুর্মুখী প্রতিরক্ষা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সম্প্রসারিত প্রতিরক্ষার ক্ষেত্রে গভীরতা কিভাবে অর্জন করা হয়?",
        options: ["মাইন ফিল্ড স্থাপনের মাধ্যমে", "প্রতিরক্ষা ফায়ারের মাধ্যমে", "বিকল্প অবস্থান দখলের মাধ্যমে", "পর পর কয়েকটি প্রস্তুতকৃত অবস্থান দখলের মাধ্যমে"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি তথ্য সংগ্রহের সাধারণ উপায় নয়?",
        options: ["অস্ত্রের বিকল্প স্থান", "টহলের মাধ্যমে", "শেল বা মর্টার প্রতিবেদন", "পথ থেকে প্রহরী কর্তৃক পর্যবেক্ষণ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েন কয় ধাপে করা উচিত?",
        options: ["১ টি", "৩ টি", "৪ টি", "৫ টি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি রণকৌশলগত পুনঃমতায়েনের মৌলিক বিবেচ্য বিষয় নয়?",
        options: ["নিয়ন্ত্রণ", "গ্রীন ব্রেক", "গতি", "নিরাপত্তা", "মনোবল বজায় রাখা"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েনে কোম্পানী পর্যবেক্ষণ দলের সংগঠন:",
        options: ["১৮ জন", "১২ জন", "২০ জন", "২৪ জন"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃ মোতায়েনের কোন ধাপে প্রয়োজনীয় বর্হি, সামগ্রী, যানবাহন পিছে পাঠানো হয়?",
        options: ["১ম ধাপে", "২য় ধাপে", "৩য় ধাপে", "৪র্থ ধাপে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি লুপসে অতিরিক্ত সময় নেয়?",
        options: ["ফিলিং আউট এর সময়", "অবস্থান যে সময়ে সম্পূর্ণ ছেড়ে দেয়া হবে", "রণকৌশলগত পুনঃমতায়নকারী সৈন্যরা যে সময়ে পুরাতন অবস্থানের পিছনে একটি নির্ধারিত রেখা অতিক্রম করবে", "পর্যবেক্ষণ দল ব্যতীত অন্য কেউ যে সময়ের পূর্বে পিছে যাবে না"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েনের জন্য প্লাটুন মিলসংহন কে নির্ধারণ করে থাকে?",
        options: ["প্লাটুন সার্জেন্ট", "কোম্পানী অধিনায়ক", "প্লাটুন অধিনায়ক", "ব্যাটালিয়ন অধিনায়ক"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোম্পানী প্রতিরক্ষা ক্ষেত্রে রণকৌশলগত পুনঃ মোতায়েনের সময় সাধারণত কি পরিমাণ জঙ্গল পশ্চাদপদ হিসেবে রাখা হয়?",
        options: ["এক সেকশন পরিমাণ", "দুই সেকশন পরিমাণ", "এক প্লাটুন পরিমাণ", "দুই প্লাটুন পরিমাণ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি আক্রমণে পদাতিক প্লাটুনের কাজ নয়?",
        options: ["বিনালব্ধি চিহ্নিত করণ এবং রক্ষণকারী দল", "মূল দল ব্যতীত অন্য যে কোন দলের (দ্বিতীয়, সহায়ককারী আক্রমণ) অংশ", "বিন্যাস ভূমিস্থ শত্রু পর্যবেক্ষণ/শ্রবণ চৌকি অপসারণ", "ফায়ার সমর্থন প্রদান করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাইন ফিল্ড অতিক্রম করার পদ্ধতি নয় কোনটি?",
        options: ["যান্ত্রিক পদ্ধতি", "মাইন উত্তলন করে নিরাপদ পথ তৈরি", "আর্টিলারি গোলা বর্ষণ", "নিরাপদ অথবা অনিরাপদ পথে একসারিতে দ্রুত মাইন ফিল্ড অতিক্রম করা"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণের পর্ব নয় কোনটি?",
        options: ["প্রস্তুতি পর্ব", "গমন পর্ব", "আক্রমণ পর্ব", "ধ্বংসাত্মক পর্ব"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি আক্রমণের মৌলিক বিশেষ বিষয় নয়?",
        options: ["সহজ সংগ্রাহ", "সময় পরিকল্পনা", "দ্রুততা", "উল্লেখ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি আক্রমণে বিন্যাস ভূমিতে করনীয় নয়?",
        options: ["নিরাপত্তা রক্ষাকারী দলের সাথে যোগাযোগ করা", "বেতার যন্ত্র পরীক্ষা ও সমন্বয় সাধন করা", "সৈনিকদের শেষবারের মত লক্ষ্য দেখানো", "অস্ত্রের লেজেন্ট লাগানো", "রণক্ষেত্র জন্য কত মিনিট বাকি আছে তা সকলকে জানানো"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যাত্রা রেখা কি ধরনের হওয়া উচিৎ?",
        options: ["লক্ষ্য বস্তুর সাথে আড়াআড়ি ভাবে বা আক্রমণ অক্ষের সমকোণে হওয়া", "যথা সম্ভব প্রাকৃতিক হওয়া উচিত, একান্ত সম্ভব না হলে সহজে চেনা যায় এমন কৃত্রিম চিহ্ন সম্বলিত হওয়া", "বিনালব্ধি ও যাত্রা রেখার মাঝখানে কোন প্রতিবন্ধক না থাকা", "উপরের সবকটি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণকারী সেনাদল কাছাকাছি কত দূরত্বে পৌঁছালে গোলন্দাজ এবং মর্টারের ফায়ার সমর্থন বন্ধ হয়ে যায়?",
        options: ["২০০-৪০০ গজ", "৩০০-৪০০ গজ", "২০০-৩০০ গজ", "৪০০-৫০০ গজ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণে সম্মুখ সমাবেশ এলাকা বসবার সময় শত্রুর দূরত্ব এবং কোন অস্ত্রের তেজের বাইরে হওয়া উচিৎ?",
        options: ["আর্টিলারী গান", "মর্টার", "এমজি", "মেটিস"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি বসতি এলাকায় যুদ্ধের নীতি নয়?",
        options: ["সহজ পরিকল্পনা", "নিয়ন্ত্রণ", "ভারসাম্য", "সীমিত রেঞ্জ বা পাল্লা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ার নিয়ন্ত্রণ আদেশ দেওয়ার পদ্ধতিকে ইংরেজি কোন শব্দ দ্বারা ব্যক্ত করা হয়?",
        options: ["GRIT", "CLAP", "CLOP", "GRIP"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি ওয়ারের উন্নয়নের অংশ নয়?",
        options: ["প্রহরীর ব্যবস্থা", "বিমূর্ত প্রতিরোধ", "ধ্বংস ও গোপনীয়তা", "ফিল্ড অফ ফায়ার পরিষ্কার করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি ফায়ারবেসের দলের অন্তর্ভুক্ত নয়?",
        options: ["পর্যবেক্ষণ দল", "নিরাপত্তা বা রক্ষী দল", "রেকি/জ্বলী টহল", "আরমরী দল"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি বসতি এলাকার আক্রমণে সেকশন সংগঠনের অংশ নয়?",
        options: ["কমান্ড গ্রুপ", "নিয়ন্ত্রণ গ্রুপ", "এসল্ট গ্রুপ", "আরমরী ফায়ার দল"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ার পরিচালনার সময় নিধন এলাকা থেকে পলায়নরত শত্রুকে প্রতিহত করা কোন দলের কাজ?",
        options: ["কার্যকরী দল", "বাধা প্রদানকারী দল", "সংরক্ষিত দল", "বিচ্ছিন্নকারী দল"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি বসতি এলাকার আক্রমণে আক্রমণকারীর সুবিধা নয়?",
        options: ["শহর পরিকল্পনা (নকশা)", "তৃতীয় মাত্রা (থার্ড ডাইমেনশন)", "অন্ধকারের ব্যবহার", "সীমিত খোলা জায়গা"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "হানা পরিচালনার সময় লক্ষ্যবস্তুতে পৌঁছে বিশেষ অর্থসম্পাদন উপলক্ষ বা লক্ষ্যবস্তু হতে কত দূরে অবস্থান গ্রহণ করে?",
        options: ["১০/১৫ গজ", "২০/৩০ গজ", "৩০/৪০ গজ", "৪০/৫০ গজ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি ক্ষণকালীন হানার লক্ষণসমূহ নয়?",
        options: ["শত্রুর গান পজিশন", "প্রধান কার্যালয়", "টেলিফোন লাইন বা এ্যাডেক্স", "বিদ্যুৎ শক্তি উৎপাদন কেন্দ্র"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মনায় সংবাদ সংগ্রহের উৎস নিরূপণ:",
        options: ["মানচিত্র", "পর্যবেক্ষণ চৌকি", "দূরবীন", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি টহলের উদ্দেশ্য?",
        options: ["শত্রুর সাথে যোগাযোগ বজায় রাখা", "শত্রু দলকে হয়রানি অথবা বিচ্ছিন্ন করা", "শত্রুর নিবারিত অবস্থান, গোলন্দাজ, ট্যাংক, সমর ইত্যাদি ধ্বংস করা", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ারবেস স্থাপনের উদ্দেশ্য বা লক্ষ্য কি?",
        options: ["শত্রু দলকে হয়রানি না বিচ্ছিন্ন করা", "বিশেষ কোন স্থানে নিজ কার্যবিধির দ্বারা শত্রুকে নৌকা দেওয়া", "কার্য সমাপর পূর্বের লক্ষ্যবস্তু সম্পর্কে অত্রও তথ্য সংগ্রহ করা", "শত্রু এলাকার যুদ্ধাত্ব নির্ভর বহিনীকে নিকটতম প্রশাসনিক সাহায্য প্রদান করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "অনিয়ম তান্ত্রিক যুদ্ধে বেগদান দেওয়ার জন্য প্রচুর কি প্রয়োজন?",
        options: ["অর্থের", "গতির", "অস্ত্র ও গোলাবারুদ", "খাবারের"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "অনিয়ম তান্ত্রিক বাহিনীর অধিনায়ক সার্বিক অধিনায়কের নিকট হতে কি ধরনের আদেশ পাবে?",
        options: ["মিশন টাইপ আদেশ", "বিস্তারিত আদেশ", "কোনটি নয়", "ক এবং খ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সাধারণত যে সকল দলগুলি ফায়ারবেসে থাকার প্রয়োজন সেগুলো হচ্ছেঃ",
        options: ["পর্যবেক্ষণ দল, নিরাপত্তা বা রক্ষীদল, রেকি/জ্বলী টহল, প্রশাসনিক দল", "পর্যবেক্ষণ দল, কার্যকরী দল, নিরাপত্তা বা রক্ষীদল, প্রশাসনিক দল", "উপরের সব কটি", "উপরের কোনটি নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যুদ্ধ মিলনস্থলে পৌঁছার কত গজ পূর্বে মূল দলকে কৌশলগত বিরতির সংকেত দিবে?",
        options: ["২০০", "৪০০", "৩০০", "কোনটিই নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "টাকে শিকার টহলের অংশই মূল লক্ষ্যে অস্ত্র সজ্জিত কত জন সৈনিক থাকে?",
        options: ["০৪ জন", "০৬ জন", "০৮ জন", "১০ জন"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফারবেস ক্ষণকালীন সময়ের জন্য হতে পারে অথবা দীর্ঘকালীন সময়ের জন্য হতে পারে, যা নির্ভর করবে",
        options: ["যুদ্ধের উদ্দেশ্য, ভূমি ও শত্রুর পরিস্থিতির উপর", "উদ্দেশের উপর", "ভূমি ও শত্রুর উপর", "উপরের কোনটি নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি ফায়ার টহল নয়?",
        options: ["বিচ্ছিন্কারী টহল (কাট অফ পার্টি)", "সংরক্ষিত টহল (রিজার্ভ পার্টি)", "শত্রুবাদা প্রদানকারী টহল (হেজিং পার্টি)", "আরমরী টহল (কভারিং পার্টি)"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "টহলেকে লভিত করার জন্য এমন নির্দিষ্ট পজিশন নেই তবে যোদ্দেশ্য নিপেক্ষের জায়গা অনুসারে কি দিতে হয়?",
        options: ["আড়াল", "পজিশন", "সেফটি রিং খোলার সময় নির্ধারণ করে", "উপরের সবগুলি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মনচিত্র পঠনে বাঞ্ছিত দিক কোন কোনটি?",
        options: ["ধ্রুব দিক কোণ", "গ্রিড দিক কোণ", "চৌম্বক দিক কোণ", "উপরের সবগুলি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "দূরত্ব পরিমাপন পদ্ধতিতে সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে ত্রুটির পার্থক্য কতটুকু ধরা করতে হবে?",
        options: ["৫ গজ", "১০ গজ", "৬ গজ", "৪ গজ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যখন গ্রিড উত্তর ও গ্রিড উত্তর একই রেখায় অনুসরণ করে তখন উক্ত রেখাকে কি বলে?",
        options: ["এগোনিক লাইন", "প্রাইম মেরিডিয়ান", "অভিসারী লাইন", "স্ট্যান্ডার্ড মেরিডিয়ান"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "জিরোইং এর সময় লক্ষ্যস্থি ভুল দূরীকরণের জন্য ফ্রন্ট সাইট টিপকে বাম থেকে ডানে, অর্থাৎ ঘড়ির কাটার দিকে ঘুরালে:",
        options: ["ফ্রন্ট সাইট টিপ নিচে যায়", "ফ্রন্ট সাইট টিপ উপরে উঠে", "ঘড়ির কাটার দিকে যায়", "কোনটি নহে"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কত দূরের সৈনিকের কাঁধের নিচে পরিক্রমণ পাতলা দেখা যায়? হাত ও পায়ের নাড়া ছাড়া পরিষ্কার দেখা যায়।",
        options: ["২০০ মি:", "৩০০ মি:", "৪০০ মি:", "৫০০ মি:"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "দূরত্ব নির্ণয়ের ক্ষেত্রে বাধা সৃষ্টিকারী পরিস্থিতি কোন টি?",
        options: ["ভূমির গঠন", "আবহাওয়া পরিস্থিতি", "আলো অথবা অন্ধকার সময়", "উপরের সবকটি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সাংকেতিক চিহ্নের ব্যবহার এর ক্ষেত্রে নিম্নের কোনটি সঠিক নয়?",
        options: ["সবুজ-গাছপালা", "নীল-পানি সংক্রান্ত বস্তু", "বাদামী-সকল প্রকার বনলি ভূমি", "লাল-কনক্রিট নির্মিত বস্তু"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "এক ইঞ্চি মাপে প্রত্যেক দুইটি সমোন্নতি রেখার মধ্যবর্তী উচ্চতা কত?",
        options: ["২০০ ফুট", "১৫০ ফুট", "১০০ ফুট", "৫০ ফুট"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে উচ্চতা প্রদর্শনের জন্য নানা রকমের রং ব্যবহৃত হয়। এক্ষেত্রে লাল রঙের ব্যবহার কতো উচ্চতা প্রকাশ করে?",
        options: ["৩০০০ ফুটের উর্দ্ধে", "২৫০০ ফুটের উর্দ্ধে", "১০০০ ফুটের উর্দ্ধে", "৫০০ ফুটের উর্দ্ধে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে বিন্দু উচ্চতা তির্যকভাবে থাকলে ভুলের পরিমাণ কমপক্ষে কত ফুট?",
        options: ["২", "১০", "১৫", "২০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে আক্ষরিক উচ্চতা কিসের সাহায্যে প্রকাশ করা যায়?",
        options: ["BM ও এর ওপর উচ্চতা লিখে", "r", "সহ এর উচ্চতা লিখে", "BM"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "বিজয় এবং শত্রু সকল প্রকার প্রতিরোধক এবং মাইন ফিল্ড দেখানোর ক্ষেত্রে কি রং ব্যবহার করা হয়?",
        options: ["লাল", "কালো", "সবুজ", "কোনটিই নয়"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি শটিং এর নীতি নয়?",
        options: ["গ্রিপ ক্রাফটের ব্যবহার", "শারীরিক সুস্থতা", "ধৈর্য ও সহিষ্ণুতা", "অন্ত্রে ব্যবহার"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "শটিং এর নীতি কয়টি?",
        options: ["৪টি", "৫টি", "৬টি", "৯টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোন ইংরেজি শব্দটি প্রহরীর অবশ্যই জানা প্রয়োজন?",
        options: ["TEGALOPPS", "TEGSAPPO", "TEGOLAPPS", "TEGOLAPPSS"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'হাত নিচের দিকে সম্পূর্ণ প্রসারিত করে পিছন থেকে সামনে নিতে হবে' কিসের সংকেত?",
        options: ["থামা", "গতি কমাও", "এগিয়ে চল", "কাছে আসো"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'হাত বরাবর হাত তুলে কনুই ভেঙে ঘন ঘন নাড়া' কিসের সংকেত?",
        options: ["তাড়াতাড়ি কর", "লঙ্গীন করা", "শান্তিত অবস্থায় যাও", "থামা"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'পাঁচ সেকেন্ড ব্যবধানে দুটি লম্ব বাঁশি' কিসের সংকেত?",
        options: ["শত্রুর বিমান আক্রমণ শেষ", "ভূমিতে নামা", "শত্রুর বিমান", "কোনটিই নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'দুটি ছোট বাঁশি' এটা কিসের সংকেত?",
        options: ["ভূমিতে নামা", "শত্রুর বিমান আক্রমণ শেষ", "বিপদ সংকেত", "শত্রুর শব্দ প্রতিরোধ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাজল উপরের দিকে রেখে হাত সম্পূর্ণ উপরে তুলতে হবে। এটা কিসের সংকেত?",
        options: ["কম সংখ্যক শত্রু দেখা যাচ্ছে", "বহু সংখ্যক শত্রু দেখা যাচ্ছে", "কোনো শত্রু দেখা যায় না", "শত্রু শক্তি প্রতিরোধ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "বাউন্ড নির্বাচনের সময় লক্ষণীয় বিষয় সমূহ কি কি?",
        options: ["রাস্তার নিকটে যেন না হয়", "বস্তু দূরত্ব নিকটে যেন না হয়", "শত্রুর দূর নিকটে বা দূরে যেন না হয়", "উপরের সবগুলো"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "পাল্লা নির্দেশিকা প্রস্তুত করার সময় লক্ষণীয় বিষয় সমূহের ক্ষেত্রে অঙ্কিত বস্তু সমূহের নাম ও দূরত্ব লিখার ক্ষেত্রে কোন পদ্ধতি অনুসরণ করতে হবে?",
        options: ["বস্তুর নাম বায়ে এবং দূরত্ব ডানে লিখতে হবে", "বস্তুর নাম ডানে এবং দূরত্ব বায়ে লিখতে হবে", "উপরের সবগুলো", "কোনটি নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিশ্বন সংখ্যা মূল্য ম্যাপে কোন অংশে থাকে?",
        options: ["ম্যাপের ঊর্ধাংশে", "ম্যাপের মধ্যাংশে", "ম্যাপের নিম্নভাগে", "ম্যাপের নিম্নংশে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে সঠিক দূরত্বকে কম মনে হয় কেন?",
        options: ["যখন আলো কম অথবা সূর্যের আলো ফায়ারারের চশম উপর পরে", "যখন ফায়ারার ও বস্তুর মধ্যবর্তী স্থানে গ্রেড গ্রাউন্ড উপস্থিত", "দর্শক যখন শোয়া অবস্থায় থাকে", "উপরের কোনটি নয়"],
        correct: 1,
        explanation: ""
    }
];
const JCOCourseQuestions
    = [
        {
        level: "JCO",
        question: "মূল প্রতিরক্ষায় প্লাটুনের কাজ নয় কোনটি?",
        options: ["খনন করা।", "সেকশন অধিনায়কের পাল্লা নির্দেশিকা তৈরী করা।", "যোগাযোগ স্থাপন করা।", "মাইন লাগানো।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "যে অবস্থান থেকে অস্ত্র ফায়ার করার সময় শত্রুর ফায়ার হতে আড় পায় এবং নিরাপদ থাকে তাকে কি পজিশন বলে?",
        options: ["এনফিলেড।", "বিকল্প।", "ডেফিলেটেড।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রতিরক্ষায় এফডিএলএ কোন অস্ত্র নষ্ট হয়ে গেলে প্লাটুন অধিনায়ক এর কর্তব্য কি?",
        options: ["গভীরের সেকশন থেকে অস্ত্র এনে ঐ স্থানে স্থাপন করা।", "কোম্পানী অধিনায়কের আদেশের জন্য অপেক্ষা করা।", "উপরের সবগুলি।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্লাটুন সদরের টেলিফোনে সব সময় লোক রাখতে হবে। ইহা নিশ্চিত করা কার কাজ?",
        options: ["প্লাটন সার্জেন্টের।", "প্লাটুন কমান্ডারের।", "সেকশন কমান্ডারের।", "উপরের সবগুলি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রতিরক্ষায় নিরাপত্তামলু ক বা রক্ষাকারী উপদল (Protective Detachment) নয় কোনটি?",
        options: ["পর্যবেক্ষণ দল।", "সংরক্ষিত দল।", "অগ্রবর্তী অবস্থান।", "পর্দা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রতিরক্ষার সমাগম এলাকায় প্লাটুন সার্জেন্টের ব্রীফিং এ সমন্বয় নির্দেশাবলী সময়াবলী তে কোন বিষয়টি উল্লেখ করতে হয়?",
        options: ["প্রতিরক্ষা অবস্থান গ্রহণের সময়।", "প্রতিরক্ষা অবস্থান শেষ করার সময়।", "ওপি পাঠানোর সময়।", "কওখ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রতিরক্ষার ক্ষেত্রে, নিচের কোনটি সবচেয়ে ছোট সংগঠন যা একটি চতুমুখী প্রতিরক্ষা নিতে পারে।",
        options: ["সেকশন।", "প্লাটুন।", "কোম্পানী।", "কোনটিই নয়।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ব্যাটালিয়ন পর্যায়ের আদর্শ প্রতিরক্ষা প্রস্তুতির জন্য মূল অবস্থান খননের সময় কত ঘন্টা?",
        options: ["৩ ঘন্টা।", "৬ ঘন্টা।", "৯ ঘন্টা।", "১২ ঘন্টা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "রক্ষণাত্নক যুদ্ধ কয়টি পর্বে সম্পন্ন হয়?",
        options: ["৪ টি।", "৫টি।", "৩টি।", "২ টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "রক্ষণমূলক ফায়ার তলব করতে হলে নিম্নলিখিত কোন তথ্যটি দিতে হবে না।",
        options: ["শত্রু সংখ্যা।", "শত্রুর অবস্থান, একটি গ্রীড সূত্র।", "শত্রু কি করছে।", "কখন তাদের দেখা গেছে।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রতিরক্ষায় একটি সেকশনের বিকল্প অবস্থান মূল অবস্থান হতে সাধারণতঃ কত দূরত্বেহওয়া উচিত?",
        options: ["২০০-৩০০ গজ।", "২৫০-৩৫০ গজ।", "১৫০-২০০ গজ।", "৩০০-৪০০ গজ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "যে ফায়ারের বিটেন জোনের অক্ষ এবং শত্রুসেনার অক্ষ মিলে যায় তাকে কি বলে?",
        options: ["এনফিলেড ফায়ার।", "ডেফিলেটেড অবস্থান।", "প্রতিভেদ রেখা।", "পাল্টা আক্রমন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্রস্তুতি অনুসারে শত্রুর সংস্পর্শে না থাকলে নিজ পছন্দমতো স্থানে প্রস্তুত করা প্রতিরক্ষা অবস্থানকে কি বলা হয়?",
        options: ["তড়িৎ প্রতিরক্ষা।", "সুপরিকল্পিত প্রতিরক্ষা।", "সংগঠিত চতুর্মুখী প্রতিরক্ষা।", "অবস্থিত চতুর্মুখী প্রতিরক্ষা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "সম্প্রসারিত প্রতিরক্ষার ক্ষেত্রে গভীরতা কিভাবে অজর্ন করা হয়?",
        options: ["মাইন ফিল্ড স্থাপনের মাধ্যমে।", "প্রতিরক্ষা ফায়ারের মাধ্যমে।", "বিকল্প অবস্থান দখলের মাধ্যমে।", "পর পর কয়েকটি প্রস্তুতকৃত অবস্থান দখলের মাধ্যমে।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিম্নের কোনটি তথ্য সংগ্রহের সাধারণ উপায় নয়?",
        options: ["অস্ত্রের বিকল্প স্থান।", "টহলের মাধ্যমে।", "শেল বা মর্টার প্রতিবেদন।", "পরিখা থেকে প্রহরী কর্তৃক পর্যবেক্ষন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি রণকৌশলগত পূনঃমোতায়ন বাস্তবায়নের প্রথম ধাপ?",
        options: ["অপ্রয়োজনীয় ব্যক্তি, সামগ্রী ও যানবাহন পেছনে পাঠানো।", "পরীক্ষাস্থল, মিলনস্থান, আরোহণ স্থান স্থাপন ও পশ্চাৎ দলের অবস্থান গ্রহন।", "পর্যবেক্ষন দলের গমন।", "পশ্চাৎদলের গমন।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নীচের কোনটি রণকৌশলগত পূনঃমোতায়েনের মৌলিক বিবেচ্য বিষয় নয়?",
        options: ["নিয়ন্ত্রন।", "ক্লীন ব্রেক।", "গতি।", "নিরাপত্তা।", "মনোবল বজায় রাখা।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "রণকৌশলগত পূনঃমোতায়েনে কোম্পানী পর্যবেক্ষণ দলের সংগঠন।",
        options: ["১৬ জন।", "১২ জন।", "২০ জন।", "২৪ জন।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "রণকৌশলগত পুনঃ মোতায়েনের কোন ধাপে অপ্রয়োজনীয় ব্যক্তি, সামগ্রী, যানবাহন পিছনে পাঠানো হয়?",
        options: ["১ম ধাপে।", "২য় ধাপে।", "৩য় ধাপে।", "৪র্থ ধাপে।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি রণপমে অতিরিক্ত সময় নয়?",
        options: ["থিনিং আউটের সময়।", "অবস্থান যে সময়ে সম্পূর্ন ছেড়ে দেওয়া হবে।", "রণকৌশলগত পূর্ণঃ মোতায়েনকারী সৈন্য যে সময়ে পুরাতন আবস্থানের পিছনে একটি নির্ধারিত রেখা আতিক্রম করবে।", "পর্যবেক্ষণ দল ব্যতীত অন্য কেউ যে সময়ের পূর্বে পিছনে যাবে না।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "রণকৌশলগত পূণঃমোতায়েন জন্য প্লাটুন মিলনস্থান কে নির্বাচন করে থাকে?",
        options: ["প্লাটনু সার্জেন্ট।", "কোম্পানী অধিনায়ক।", "প্লাটুন অধিনায়ক।", "ব্যাটালিয়ন অধিনায়ক।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোম্পানী প্রতিরক্ষার ক্ষেত্রে রণকৌশলগত পুণঃমোতায়েনের সময় সাধারনত কি পরিমাণ জনবল পশ্চাৎদল হিসেবে রাখা হয়?",
        options: ["এক সেকশন পরিমান।", "দুই সেকশন পরিমান।", "এক প্লাটনু পরিমান।", "দুই প্লাটনু পরিমান।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিজানে শত্রুর অবস্থান নির্ণয়ের পদ্ধতি কোনটি।",
        options: ["সমন্বয় করা।", "চলাচল।", "বেসামরিক ব্যাক্তিথেকে তথ্য সংগ্রহ করা।", "কোনটিই নয়।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানে পার্শ্বরক্ষী বা ফ্ল্যাংকগার্ড কোন দলের অংশ?।",
        options: ["আবরণী সেনা বা কভারিং ট্রপস।", "অগ্ররক্ষী বা ভ্যানগার্ড।", "মোবাইল ট্রপস।", "প্রধানদল বা মেইন বডি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিচের কোনটি অগ্রাভিযানের বিস্তারিত সংযোগ প্রতিবেদনের অংশ নয়?",
        options: ["সংঘর্ষের সময়।", "সংঘর্ষের স্থান। (বর্গ/জিআর ব্যতিত)।", "শত্রুর শক্তি/জনবল।", "শত্রু কি করছে?"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানের সাফল্য প্রধানত নির্ভর করে নিম্নের কোন বিষয়টির উপর?",
        options: ["দূরদৃষ্টি।", "ভালো যোগাযোগ ব্যবস্থা।", "বিস্তার লাভে সহজ পদ্ধতি।", "উপরের সবকয়টি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযান পরিকল্পনায় বিবেচ্য বিষয় নয় কোনটি?",
        options: ["বর্তমান পরিস্থিতি।", "সংযুক্তি/বিযুক্তি।", "দায়িত্বপূর্ণ এলাকা।", "বিস্তৃতি/সীমানা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি অগ্রাভিযানের আবরণী সেনা বা কভারিং ট্রুপস এর অংশ নয়?",
        options: ["মোবাইল ট্রুপস।", "ফ্ল্যাংক গার্ড।", "ভ্যান গার্ড।", "উপরের সবগুলো।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানে তড়িৎ আক্রমণে প্লাটুন কর্তৃক সেকশন বাঁধা অপসারণের সময় কয় মিনিট?",
        options: ["৪৫ মিনিট থেকে ১ ঘন্টা।", "২০ থেকে ৩০ মিনিট।", "১৫ থেকে ৪৫ মিনিট।", "১০ মিনিটি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি অগ্রাভিযানে প্লাটুনের নিয়োগ নয়?",
        options: ["পয়েন্ট প্লাটুন হিসেবে।", "ফ্ল্যাংক গার্ড হিসেবে।", "সংরক্ষিত দল হিসেবে।", "রিয়ারগার্ড এর অংশ হিসেবে।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানে সেকশনের এবং প্রত্যেক সৈনিকের বিস্তৃতি সব সময় পর্যন্ত হবে। নমনু। হিসেবে দুই সেকশনের মধ্যবতী দূরত্ব ২০০ গজের বেশী হওয়া উচিৎ নয়। খুব খোলা জায়গায় এ দূরত্ব বাড়ানো যায় এবং সংকীর্ণ স্থানে কম করতে হয়।",
        options: ["দৃষ্টি সীমা।", "শ্রবণ সীমা।", "দৃষ্টি ও শ্রবণ সীমা।", "নিয়ন্ত্রণ সীমা।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানের পার্শ্বে নিরাপত্তামূলক ব্যবস্থা গ্রহণ করে কোন দলটি।",
        options: ["মোবাইল ট্রপস।", "ফ্লাংক গার্ড।", "সম্মু খরক্ষী।", "অগ্ররক্ষী।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "প্লাটুন অধিনায়ক, প্লাটুন আক্রমণের পূর্বে পয়েন্ট সেকশন অধিনায়কে ব্রিফিং এর সময় কোন তথ্যটি উল্লেখ করবেন?",
        options: ["আদেশ দলের মিলনস্থান।", "আদেশ দলের গাইড।", "আক্রমণে অংশগ্রহনকারী সেনা দলের সংগঠন।", "আক্রমণের দিক ও বিন্যাস ভূমি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিমের কোনটি অগ্রাভিযানের ধরণ নয়?",
        options: ["শত্রুর পশ্চাৎ প্রসরণের সময়।", "যোগাযোগ স্থাপনের জন্য অগ্রাভিযান।", "যোগাযোগ অবস্থান থেকে অগ্রাভিযান।", "বিস্তার লাভের সহজ পদ্ধতি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অগ্রাভিযানে আর আর সেকশনের কোন কাজে ব্যবহৃত হয়?",
        options: ["অগ্রাভিযানকারী সৈন্যদলকে শত্রুর ট্যাংক থেকে রক্ষা করা।", "শত্রুর অবস্থান ধ্বংস করা।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নীচের কোনটি আক্রমনে পদাতিক প্লাটুনের কাজ নয়?",
        options: ["বিন্যাসভূমি চিহ্নিত করণ এবং রক্ষাকারী দল।", "মূল দল ব্যতীত অন্য যে কোন দলের (দ্বিতীয়, নস্যাৎকারী আক্রমন) অংশ।", "বিন্যাস ভূমিত শত্রুর পর্যবক্ষেণ/ শ্রবণ চৌকি অপসারন।", "ফায়ার সমর্থন প্রদান করা।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি আক্রমনে যাত্রা রেখার (জক) সাথে সম্পর্কিত নয়?",
        options: ["এ্যাসল্ট সেনার অগ্রবর্তী অংশকে রণ ঘন্টায় যে রেখা অতিক্রম করতে হয়।", "সহজেই ভূমিতে চেনা যায়।", "আক্রমনকারী সেনা এ রেখায় পৌছালে গোলন্দাজ কামান সমূহ সম্মুখু স্থ শত্রু অবস্থানে গোলাবর্ষণ বন্ধ করবে।", "এটি আক্রমনের অক্ষের সমকোনে একটি রেখা।", "এটি সাধারনতঃ বিন্যাসভূমির কাছাকছি এবং যতদূর সম্ভব শত্রুর সরাসরি ফায়ার থেকে মুক্ত।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নীচের কোনটি তড়িৎ আক্রমনের বৈশিষ্ট্য নয়?",
        options: ["সাধারণত শত্রুর দূর্বল বা অসম্পূর্ন অবস্থানের উপর পরিচালিত হয়।", "পর্যবেক্ষণ ও পরিকল্পনার জন্য যথা সম্ভব অল্প সময় ব্যয় করা হয়।", "আক্রমনকারী সৈন্যদের সহায়তার জন্য গোলন্দাজ, সাঁজোয়া ইত্যাদির পরিকল্পিত সাহায্য নেয়া বাঞ্চনীয়।", "এই আক্রমন সাধারনতঃ অগ্রাভিযানের সময় হয়ে থাকে।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি আক্রমনের মৌলিক বিবেচ্য বিষয় নয়?",
        options: ["সংবাদ সংগ্রহ।", "সহজ পরিকল্পনা।", "দ্রুততা।", "উদ্যোগ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নীচের কোনটি আক্রমনে বিন্যাস ভূমিতে করনীয় নয়?",
        options: ["নিরাপত্তা রক্ষাকারী দলের সাথে যোগাযাগ করা।", "বেতার যন্ত্র পরীক্ষা ও সমন্বয় সাধন করা।", "সৈনিকদের শেষবারের মত লক্ষ্য বস্তু দেখানো।", "অস্ত্রের বেয়নেট লাগানো।", "রণঘন্টার জন্য কত মিনিট বাকী আছে তা সকলকে জানানো।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "যাত্রা রেখা কি ধরনের হওয়া উচিৎ?",
        options: ["লক্ষ্য বস্তুর সাথে আড়া-আড়ি ভাবে বা আক্রমণ অক্ষের সমকোণে হওয়া।", "যথা সম্ভব প্রাকৃতিক হওয়া উচিত, একান্ত সম্ভব না হলে সহজে চেনা যায় এমন কৃত্রিম চিহ্ন সম্বলিত হওয়া।", "বিন্যাসভূমি ও যাত্রা রেখার মাঝখানে কোন প্রতিবন্ধক না থাকা।", "উপরের সবকটি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "আক্রমণে সেনাদল শত্রুর কাছাকাছি কত দূরত্বে পৌঁছালে গোলন্দাজ এবং মর্টারের ফায়ার সমর্থন বন্ধ হয়ে যায়?",
        options: ["২০০-৪০০ গজ।", "৩০০-৪০০ গজ।", "২০০-৩০০ গজ।", "৩০০-৫০০ গজ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "আক্রমনে সম্মুখ সমাবেশ এলাকা যতদুর সম্ভব শত্রুর দৃষ্টির এবং কোন অস্ত্রের রেঞ্জের বাহিরে হওয়া উচিৎ?",
        options: ["আটিলারী গান।", "মর্টার।", "এমজি।", "মেটিস।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "আক্রমনে মাইন ক্ষেত্র অতিক্রম করার পর প্লাটুনের করনীয় কি?",
        options: ["পূর্বের ন্যায় আক্রমণের ফরমেশনে সজ্জিত হওয়া।", "শুয়ে পরে আস্তে আস্তে অগ্রসর হওয়া।", "বেয়নেট লাগানো।", "শত্রুর দিকে গ্রেনেড ছুঁড়ে মারা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "সময়ের উপর ভিত্তি করে আক্রমন কত প্রকার?",
        options: ["দুই।", "তিন।", "চার।", "পাঁচ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "আক্রমণ পরিকল্পনাকালে কয়টি মৌলিক বিষয় মনে রাখতে হবে?",
        options: ["৭টি।", "৮ টি।", "৯ টি।", "১০ টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি বসতি এলাকায় যুদ্ধের নীতি নয়?",
        options: ["সহজ পরিকল্পনা।", "নিয়ন্ত্রণ।", "ভারসাম্যতা।", "সীমিত রেঞ্জ বা পাল্লা।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "শহর/বসতি এলাকায় আক্রমনকে কয়টি পর্বে ভাগ করা যেতে পারে?",
        options: ["৩ টি।", "৪ টি।", "৫ টি।", "কোনটিই না।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "বসতি এলাকায় যুদ্ধে একটি বিল্ডিং পরিস্কার বা শত্রুমুক্ত করতে একটি সেকশনকে কয়টি দলে সংগঠিত করা হয়?",
        options: ["৩ টি।", "৪ টি।", "৫ টি।", "কোনটিই নয়।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি ফার্মবেসের দলের অর্ন্তভুক্ত নয়?",
        options: ["পর্যবেক্ষণ দল।", "নিরাপত্তা বা রক্ষী দল।", "রেকি/জংগী টহল।", "আবরনী দল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "হানা অপারেশনে পশ্চাৎ কর্তৃত্বকারী উপদল (রিয়ার কমান্ড গ্রুপ) কোন উপদলের অংশ?",
        options: ["কার্যকরী দল।", "বাধা প্রদানকারী দল।", "আবরনী দল।", "বিচ্ছিন্নকারী দল।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ফাঁদ কার্য পরিচালনার সময় নিধন এলাকা থেকে পলায়নরত শত্রুকে প্রতিহত করা কোন দলের কাজ?",
        options: ["কার্যকরী দল।", "বাধা প্রদানকারী দল।", "সংরক্ষিত দল।", "বিচ্ছিন্নকারী দল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ভূমির পারিপার্শ্বিক অবস্থানের সাথে সামঞ্জস্য রেখে খুব সাবধানতার সাথে শত্রুর নিকটবর্তী হয়ে নিজের উদ্দেশ্যকে সম্পন্ন করে নিজের জায়গায় ফেরত আসাকে কি বলে?",
        options: ["ফাঁদ।", "হানা।", "স্টকিং।", "টহল।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "হানা পরিচালনার সময় লক্ষ্যবস্তুতে পৌছে বিশেষ কার্যসম্পাদন উপদল বাদে লক্ষ্যবস্তু হতে কত দূরে অবস্থান গ্রহণ করে?",
        options: ["১০/১৫ গজ।", "২০/৩০ গজ।", "৩০/৫০ গজ।", "৪০/৫০ গজ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি স্বল্পকালীন হানার লক্ষ্যবস্তু নয়?",
        options: ["শত্রুর গান পজিশন।", "প্রধান কার্য্যালয়।", "টেলিফোন লাইন বা এক্সচেঞ্জ।", "বিদ্যুৎ শক্তি উৎপাদন কেন্দ্র।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "হানায় সংবাদ সংগ্রহের উৎস নিমরূপঃ",
        options: ["মানচিত্র।", "এয়ার ফটো।", "যুদ্ধবন্দী।", "কওগ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিচের কোনটি টহলের উদ্দেশ্য?",
        options: ["শত্রুর সাথে যোগাযোগ বজায় রাখা।", "শত্রু দলকে হয়রানি অথবা বিচ্ছিন্ন করা।", "শত্রুর নিবার্চিত অবস্থান, গোলন্দাজ, ট্যাংক, সদর ইত্যাদি ধ্বংস করা।", "কওখ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ফার্মা বস স্থাপনের উদ্দেশ্য বা লক্ষ্য কি?",
        options: ["শত্রু দলকে হয়রানি বা বিচ্ছিন্ন করা।", "বিশেষ কোন স্থানে নিজ কার্যাদির দ্বারা শত্রুকে ধোঁকা দেয়া।", "কার্য সমাধার পূর্বে লক্ষ্যবস্তু সম্পর্কে আরো তথ্য সংগ্রহ করা", "শত্রু এলাকায় যুদ্ধরত নিজস্ব বাহিনীকে নিকটতম প্রশাসনিক সাহায্য প্রদান করা।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অনিয়মতান্ত্রিক যুদ্ধের জন্য কিসের যোগান দেওয়ার জন্য প্রচুর অর্থের প্রয়োজন?",
        options: ["অর্থের।", "গাড়ির।", "অস্ত্র ও গোলাবারুদের।", "খাবারের।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "অনিয়মতান্ত্রিক বাহিনীর অধিনায়ক সার্বিক অধিনায়কের নিকট হতে কি ধরনের আদেশ পাবে?।",
        options: ["মিশন টাইপ আদেশ।", "বিস্তারিত আদেশ।", "কোনটিই নয়।", "ক এবং খ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিচের কেনটিকে ইমারজেন্সির মূল কারণ বিবেচনা করা হয়?",
        options: ["সংখ্যা লঘুদের মধ্যে অসন্তোষ।", "রক্ষনশীল দৃষ্টি ভংগী।", "উপরের সব কয়টি।", "উপরের কোনটি নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "চূড়ান্ত মিলনস্থান নির্বাচনের সময় একজন অধিনায়ক কোন কোন বিষয় বিবেচনা করবেন?",
        options: ["সম্পূর্ণ টহলদের জন্য যথেষ্ট জায়গা।", "সহজে চেনা যায়।", "কওখ।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিচের কোন বিষয়টি সকল প্রহরীর জানা উচিৎ।",
        options: ["ভূমিচিহ্ন", "ছাড়শব্দ।", "কোন ভূমি দেখতে হবে।", "খওগ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ফিল্ড সিগন্যাল নিম্নোক্ত কোন জিনিসের মাধ্যমে প্রদান করা হয়?",
        options: ["হাতের মাধ্যমে সংকেত।", "রাইফেলের মাধ্যমে সংকেত।", "বাঁশীর মাধ্যমে সংকেত।", "উপরের সবকটি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "দূরত্ব নির্ণয় করার সময় নিম্নলিখিত কোন পরিস্থিতি সমূহ বাধার সৃষ্টি করে?",
        options: ["ভুমির গঠন।", "আবহাওয়ার পরিস্থিতি।", "আলো অথবা অন্ধকার সময়।", "উপরের সবকটি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "চূড়ান্ত মিলনস্থানে পৌছার কত গজ পূর্বেই মূল দলকে স্বল্পকালীন বিরতির সংকেত দিবে?",
        options: ["২০০।", "৪০০।", "৬০০।", "কোনটিই নয়।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ট্যাংক শিকার টহলের আবরণী দলে মলু তঃ অস্ত্র সজ্জিত কত জন সৈনিক থাকে?",
        options: ["০৪ জন।", "০৬ জন।", "০৮ জন।", "১০ জন।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ফার্মা বস স্বল্পকালীন সময়ের জন্য হতে পারে অথবা দীর্ঘকালীন সময়ের জন্য হতে পারে, যা নির্ভর করবে।",
        options: ["যুদ্ধের উদ্দেশ্য, ভূমি ও শত্রু পরিস্থিতির উপর।", "উদ্দেশের উপর।", "ভূমি ও শত্রুর উপর", "উপরের কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নীচের কোনটি ফাঁদের উপদল নয়?",
        options: ["বিচ্ছিন্নকারী উপদল (কাট অফ পার্টি)।", "সংরক্ষিত উপদল (রিজার্ভ পার্টি)।", "শত্রু বাধা প্রদানকারী উপদল (হোল্ডিং পার্টি)।", "আবরণী উপদল (কভারিং পার্টি)।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কখন সঠিক দূরত্বকে কম মনে হয়?",
        options: ["বস্তু যখন আশে পাশের বস্তুর তুলনায় বড় হয়।", "যখন উপত্যকার মধ্য দিয়ে দেখা হয়।", "দর্শক যখন শোয়া অবস্থায় থাকে।", "কোনটাই না।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিয়মতান্ত্রিক ও অনিয়মতান্ত্রিক যুদ্ধের পুরো বাহিনী সংগঠিত হবে কয়টি দল দ্বারা?",
        options: ["২ টি।", "৩টি।", "৪ টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "গ্রেনেডকে লবিং করার জন্য এমন কোন নির্দিষ্ট পজিশন নেই তবে গ্রেনেড নিক্ষেপের জায়গা অনুসারে নিতে হয়।",
        options: ["আড়াল।", "পজিশন।", "সেফটি রিং খোলার সময় নির্ধারণ করে।", "উপরের সবগুলি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "মানচিত্র পঠনে ব্যবহৃত দিক কোণ কোনটি?",
        options: ["ধ্রুব দিক কোণ।", "গ্রিড দিক কোণ।", "চৌম্বক দিক কোণ।", "উপরের সবগুলো।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "দৃষ্টি পরিবর্তন পদ্ধতিতে সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে দৃষ্টির পার্থক্য কতদ্বারা গুন করতে হবে।",
        options: ["৫ গুণ।", "১০ গুণ।", "৩ গুণ।", "৪ গুণ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "যখন ধ্রুব উত্তর ও গ্রিড উত্তর একই রেখায় অবস্থান করে তখন উক্ত রেখাকে কি বলে?",
        options: ["এ্যাগোনিক লাইন।", "প্রাইম মেরিডিয়ান।", "অভিসারী লাইন।", "স্ট্যান্ডার্ড মেরিডিয়ান।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "জিরোইং এর সময় লম্বালম্বি ভুল দূরীকরণের জন্য ফ্রন্ট সাইট টিপকে বাম থেকে ডানে, অর্থাৎ ঘড়ির কাটার দিকে ঘুরালে।",
        options: ["ফ্রন্ট সাইট টিপ নীচে যায়।", "ফ্রন্ট সাইট টিপ উপরে উঠে।", "ঘড়ির কাটার দিকে যায়।", "কোনটি নহে।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কত দূরের সৈনিকের কাঁধের নিচে পর্যায়ক্রমে পাতলা দেখা যায়। হাত ও পায়ের নাড়া চাড়া পরিস্কার দেখা যায়।",
        options: ["২০০ মিঃ।", "৩০০ মিঃ।", "৪০০ মিঃ।", "৫০০ মিঃ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কত দূরের সৈনিকের চেহারা চেনা মুশকিল, কিন্তু শরীরের অংশ দেখা যায়?",
        options: ["২০০ মিঃ।", "৩০০ মিঃ।", "৪০০ মিঃ।", "৫০০ মিঃ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "দূরত্ব নির্ণয় করার সময় কোনটি গ্রহণযোগ্য ভুল হতে পারে।",
        options: ["৩০০ মিটার পর্যন্ত দূরত্বের জন্য ৫০ মিটার কম অথবা বেশী।", "৫০০ মিটার থেকে ১০০০ মিটার পর্যন্ত ১৫০ মিটার কম অথবা বেশী।", "১০০০ মিটার থেকে ১২০০ মিটার পর্যন্ত ২০০ মিটার কম অথবা বেশী।", "কোনটি নহে।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি সাংকেতিক চিহ্নের বৈশিষ্ট নয়।",
        options: ["মাপনী বিহীন।", "ম্যাপে স্থায়ী ছাপানো থাকে।", "নির্দিষ্ট রঙ ব্যবহার করা হয়।", "সকল প্রাকৃতিক ও কৃত্রিম ফিচারের সংক্ষিপ্ত রূপ"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি ইন্টার সেকশন বের করার পদ্ধতি নয়।",
        options: ["কম্পাস দিক কোণ নেয়া।", "কম্পাস ভুল বের করা।", "পশ্চাৎ দিক কোণ নেয়া।", "ছেদ বিন্দু বের করা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিম্নের কোন কাজ ভূমির বস্তু ম্যাপে নির্ণয় করার পদ্ধতি নয়।",
        options: ["কম্পাস দিক কোণ কে গ্রীড দিক কোণে পরিবতর্ন।", "বস্তুটির উস্বক্তা।", "বস্তুটির উচ্চতা।", "ম্যাপে সূক্ষ্ম একটি সরল রেখা অংকন করা।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ম্যাপে বিন্দু উচ্চতা তির্যকভাবে থাকলে ভুলের পরিমান কমপক্ষে কত ফুট?",
        options: ["৫।", "১০।", "১৫।", "২০।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ম্যাপে আপেক্ষিক উচ্চতা কিসের সাহায্যে প্রকাশ করা যায়?",
        options: ["আখ ও এর উপর উচ্চতা লিখে।", "ক্ষ।", "ক্ষ সহ এর উচ্চতা লিখে।", "আখ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "নিজস্ব এবং শত্রুর সকল প্রকার প্রতিবন্ধক এবং মাইন ফিল্ড দেখানোর ক্ষেত্রে কি রং ব্যবহার করা হয়।",
        options: ["লাল।", "কালো।", "সবুজ।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "সাহায্যকারী চিহ্ন কয়টি হতে পারে।",
        options: ["২-৩।", "৩-৪।", "৪-৫।", "যতো ইচ্ছা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "ম্যাপে বিন্দু উচ্চতা খাড়াভাবে থাকলে ভুলের পরিমান কত ফুট?",
        options: ["৫।", "১০।", "১৫।", "২০।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "JCO",
        question: "সাহায্যকারী চিহ্ন নির্বাচন করার পূর্বে নিম্নলিখিত কোন বিষয়গুলি অবশ্যই বিবেচনা করতে হবে।",
        options: ["সাহায্যকারী চিহ্ন অবশ্যই দায়িত্বপূর্ণ এলাকার সম্পূর্ণ ৩৬০ মধ্যে হতে হবে।", "এদেরকে ডান দিক হতে বাম দিকে নিযুক্ত করতে হবে।", "অবশ্যই ভূমিতে স্থায়ী হবে।", "দুইটি সাহায্যকারী চিহ্নের একই নাম একই হতে হবে।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "JCO",
        question: "কোনটি স্টকিং এর নীতি নয়।",
        options: ["বিনা প্রয়োজনে স্থান ত্যাগ না করা।", "শারীরিক সুস্থতা।", "ধৈর্য্য ও সহিষ্ণুতা", "অস্ত্রের ব্যবহার।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "JCO",
        question: "স্টকিং এর দিক নির্ণয়ের সাহায্যকারী বস্তু কোনটি?",
        options: ["রাস্তার বাঁক।", "ঈদগাহ।", "তালগাছ।", "নাইট ভিশন ডিভাইস।"],
        correct: 1,
        explanation: ""
    }
    ];
const magQuestions = [
    {
        level: "MAG",
        question: "গোলন্দাজ অস্ত্রকে নিম্নলিখিতভাবে ভাগ করা হয়েছেঃ",
        options: ["তিন ভাগে", "চার ভাগে", "পাঁচ ভাগে", "ছয় ভাগে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ভূমি গোলন্দাজ (ফিল্ড আর্টিলারি) কত প্রকারঃ",
        options: ["০২", "০৩", "০৪", "০৪"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "এয়ার ডিফেন্স আর্টিলারি কত প্রকারঃ",
        options: ["০৬", "০৫", "০৩", "০৬"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "কইক ফায়ারিং অস্ত্র সমূহ সাধারণত ক্যালিবার পর্যন্ত হতে পারেঃ",
        options: ["১১০ মিঃ মিঃ", "১২০ মিঃ মিঃ", "১৩০ মিঃ মিঃ", "১৪০ মিঃ মিঃ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "সার্ভিসেস কয় ধরনের মর্টরে ব্যবহার করা হয়ঃ",
        options: ["০২ ধরনের", "০৩ ধরনের", "০৪ ধরনের", "০৫ ধরনের"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "মর্টারে বৈশিষ্ট্য কয়টিঃ",
        options: ["০৪টি", "০৫টি", "০৬টি", "০৭টি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ডেটোনেশন বিস্তারের গতিবেদ প্রতি সেকেন্ড ৩০০০ থকে মিটারের মধ্যে হয়ঃ",
        options: ["৭০০০ মিটার", "৮০০ মিটার", "৯০০০ মিটার", "৬০০ মিটার"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ব্যবহার অনুযায়ী বিস্ফোরক প্রধান্ত ভাগে ভাগ করা হয়েছেঃ",
        options: ["০২", "০৩", "০৪", "০৫"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "প্রোপেল্যান্টকে প্রধান্ত ভাগে ভাগ করা হয়েছে।",
        options: ["০২", "০৩", "০৪", "০৫"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ব্যবহার অনুযায়ী উচ্চ বিস্ফোরক ভাগে ভাগ করা হয়েছে।",
        options: ["০২", "০৪", "০৫"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "প্রজ্জ্বলনের মাধ্যমে প্রকার।",
        options: ["০২", "০৩", "০৪", "০৫"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ক্ষুদ্রান্ত্রের গোলাবারুদ মোট টি অংশে নিয়ে গঠিত।",
        options: ["০৩টি", "০৫টি", "০৪টি", "০৬টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ট্রেসার কার্তুজ বুলেটের মাথায় রং লাগানো থাকে।",
        options: ["লাল", "নীল", "সবুজ", "হলুদ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ট্যাংক বিধ্বংসী সট প্রকার। যথা।",
        options: ["০৪টি", "০৫টি", "০৬টি", "০৭টি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "একটি ফিউজের প্রধান কয়টি অংশ থাকে?",
        options: ["০৪টি", "০৫টি", "০৬টি", "০৭টি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "বোম্ব এম এল ৬০ মিঃ মিঃ মর্টার এইচ ই টাইপ-১৯৯৩ চায়না) ওজন ?",
        options: ["২.২০ কেজি", "৩.২০ কেজি", "১.২০ কেজি", "২.১০ কেজি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "বোম্ব এমএল ৮২ মিটার এইচ ই টাইপ-১৯৫৩ (চায়না) এর সব্বোর্চ দুরত্ব মিটার?",
        options: ["৪৫০০ মিটার", "৪৬০০ মিটার", "৪৭০০ মিটার", "৪৮০০ মিটার"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "প্র্যাকটিস গ্রেনেড আরজেস-৭২ (অস্ট্রিয়া) প্রশিক্ষণ মাঠের উপর নির্ভর করে গ্রেনেডটি মোট বার নিক্ষেপ করা যায়?",
        options: ["৭০০ বার", "৭৫০ বার", "৮০০ বার", "৮৫০ বার"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ব্যবহার উপর নির্ভর করে প্রশিক্ষণ গ্রেনেড বার ব্যবহার করা যায়?",
        options: ["৮০০", "৯০০", "১০০০", "৭০০"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গ্রেনেড হ্যান্ড আরজেস-৮৪ বিডি বিশদ সীমা কত?",
        options: ["১৫-২০ মিটার", "২০-৩০ মিটার", "১৫-২০ মিটার", "২০-২৫ মিটার"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "আতশবাজী গোলাবারুদ এর সংকেতের স্থায়ীত্বকাল ?",
        options: ["৬.৫ সেকেন্ড", "৪.৫ সেকেন্ড", "৪.৫ সেকেন্ড", "৩.৫ সেকেন্ড"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "রকেট গোলাবারুদ অংশ নিয়ে গঠিত হয়?",
        options: ["০৩টি", "০৪টি", "০৫টি", "০৬টি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "সকল বিস্ফোরক/গোলাবারুদকে টি শ্রেনীতে ভাগ করা হয়েছে?",
        options: ["১০টি", "১২টি", "১৫টি", "২০টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গোলাবারুদ গুদামঘরে এবং উহার গজের ভিতরে ধুমপান করা নিষেধ?",
        options: ["দশ গজ", "পনের গজ", "বিশ গজ", "ত্রিশ গজ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গোলাবারুদ রক্ষণাবেক্ষনের ক্ষেত্রে মূলমন্ত্র কয়টি?",
        options: ["০২ টি", "০৩টি", "০৪টি", "০৫টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ফিক্স রাউন্ড এ্যামোনিশন টি অংশ নিয়ে তৈরী হয়।",
        options: ["০৩টি", "০৪টি", "০৫টি", "০৬টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গোলাবারুদের সীল বক্স পরিদর্শনের ক্ষেত্রে ভাগ পরিদর্শন করতে হবে।",
        options: ["১%", "২%", "৩%", "৫%"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "খালি কার্তুজ জমাদানের ক্ষেত্রে কয় কপি ভাউচার তৈরী করতে হবে।",
        options: ["২ কপি", "৩ কপি", "৪ কপি", "৫ কপি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গোলাবারুদ লেজার কয়টি অংশ থাকে।",
        options: ["০৪টি", "০৫টি", "০৬টি", "০৭টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "আতশবাজী কার্তুজ কত প্রকার।",
        options: ["দুই প্রকার", "তিন প্রকার", "চার প্রকার", "পাঁচ প্রকার"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ফিউজ প্রতি লটে উৎপন্ন করা হয়।",
        options: ["২২০০", "২৩০০", "২৪০০", "২৫০০"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "খালি কার্তুজ জমাদানে কোন ফরম তৈরী করতে হয়।",
        options: ["বএএফজেড-২০৯৬", "বিএএফও-১৪৪৪এ", "বিএএফও-২৭৮৭", "বিএএওয়-২৭৯০"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "নিয়ন্ত্রিত দ্রব্যসামগ্রী চাহিদা করার ক্ষেত্রে কয় কপি চাহিদা পত্র তৈরী করতে হয়?",
        options: ["১৪ কপি", "০৫ কপি", "৩৬ কপি", "০৭ কপি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "অনিয়ন্ত্রিত দ্রব্যসামগ্রী চাহিদা করা ক্ষেত্রে কয় কপি চাহিদা পত্র তৈরী করতে হয়?",
        options: ["০২ কপি", "০৩ কপি", "০৪ কপি", "০৫ কপি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "বোম্ব এমএমল ৬০ মিঃমিঃ মর্টার এইচ টাইপ-১৯৯৩ এর বৃদ্ধিকারক কার্তুজের সংখ্যা টি?",
        options: ["০৫", "০৬", "০৭", "০৮"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ল্যান্ড সাইন প্রকার?",
        options: ["০৪", "০৫", "০৬", "০৭"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "যে সকল মোড়ককৃত গোলাবারুদ ফসফাইড বা সাদা ফসফরাস যা অন্যান্য উপকরণসহ বিদ্যমান।",
        options: ["জিইজি-৮", "জিইজি-১০", "জিইজি-১১", "জিইজি-১২"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "একটি আদর্শ ট্রেন্স সেন্টারের পরিমান কত?",
        options: ["১৪×৮০৬", "১৪০৯০৮", "১৪০৮০৭", "১৪০৮০৬"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "এফসিসি অর্ডন্যান্স ডেপো/সিওডিতে জমা করার সময় নিম্নের কোনটি প্রয়োজন নেই?",
        options: ["বিএএফও-২০৯৬", "প্রাধিকার পত্র", "সংশ্লিষ্ট গোলাবারুদ বক্স", "এটিও পরিদর্শন ফরম"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ব্যত্যয় প্রতিবেদন পলিসি কোনটি?",
        options: ["এসবিএও ২/৭৫", "এসবিএও-২/২৭৪", "এসবিএও-৮/২০১৯", "কোনটি নয়"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "হোহাট ফসফরাস গোলাবারুদ যে ষ্টোরে মজুদ থাকে সেই ষ্টোরের বাহিরে রাখতে হবে?",
        options: ["বালি ও পানি", "পানি ও ফায়ার এক্সটিংগুইসার", "পানি কপার সালফার দ্রবন", "উপরের সব গুলো"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "গোলাবারুদ লেজার ৫ম অংশে কি বিষয় উল্লেখ থাকে?",
        options: ["১ম সারি গোলাবারুদ", "২য় সারির গোলাবারুদ", "ড্রিল ও ডামি", "পূর্ণঃ লাভ"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "আইএম ডিজি কোড কয়টি শ্রেণীতে ভাগ করা ছ?",
        options: ["১০ টি", "০৯ টি", "০৮ টি", "কোন নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "২৬ মিঃ মিঃ ইলুমিনেটিং কার্তুজ এ টি পিপস থাকে?",
        options: ["০১", "০২", "০৩", "০৪"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "প্রদানের জন্য ভগ্নাংশ বক্স চিহ্নিত করে রাখতে হবে?",
        options: ["স্তূপের মাঝে", "স্তুপের উপরে", "স্তুপের নিচে", "আলাদাভাবে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "অস্ত্রের গানের ব্যারেলের কপার মুক্ত করার জন্য নিম্নের কোন ব্যবহার করা হয়?",
        options: ["টিন ফুয়েলপ্রাত্র", "পরিস্কার কাপড়", "সীমা", "১ এবং ৩"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "ম্যাগাজিনে ভর্তি বিস্ফোরক গুনাগুনের উপর ভিত্তি করে ফিউজকে ভাগে ভাগ করা হয়েছে?",
        options: ["০৪ ভাগে", "০৩ ভাগে", "০২ ভাগে", "০৫ ভাগে"],
        correct: 2,
        explanation: ""
    },
    {
        level: "MAG",
        question: "টাইগার MRS TRG-৩০০ এর সর্বোচ্চ ফায়ারিং রেঞ্জ কিঃ মিঃ?",
        options: ["১২০ কিঃ মিঃ", "৯০ কিঃ মিঃ", "৭০ কিঃ মিঃ", "৮০ কিঃ মিঃ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "MAG",
        question: "APIT কার্তুজ কি উদ্দেশ্য তৈরী করা হয়?",
        options: ["শক্ত ও কঠিন লক্ষ্য বস্তুর ক্ষতি সাধন করা।", "লক্ষ্য বস্তুতে আগুন জালানো।", "বুলেটের গতি পথ নির্দেশ করা।", "উপরের সবগুলি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "MAG",
        question: "বাংলাদেশ সেনাবাহিনীতে প্রশন সিগন্যাল কার্তুজ ব্যবহার করা হয়?",
        options: ["০২ প্রকার", "০৩ প্রকার", "০৪ প্রকার", "০৫ প্রকার"],
        correct: 1,
        explanation: ""
    },
    {
        level: "MAG",
        question: "এন্টি ট্যাংক গাইডেড উইপন মেটিস এম-১ (SR) ক্ষেপনাস্ত্রাটি মিঃ পর্যন্ত দিবারাত্রী এবং দুর্যোগ পূর্ণ আবহাওয়া কার্যকরী।",
        options: ["৮০-২০০০ মিঃ", "৮০-১০০০ মিঃ", "৬০-৩০০০ মিঃ", "৪০০০ মিঃ"],
        correct: 0,
        explanation: ""
    }
];

let player = {};
let selectedQuestions = [];
let current = 0;
let score = 0;
let timer;
let Time = 15;
let hasAnswered = false;

let correctSound = document.getElementById("correctSound");
let wrongSound = document.getElementById("wrongSound");

// INITIALIZATION & CONNECTION CHECK
window.onload = async () => {
    try {
        const response = await fetch("/api/status");
        if (response.ok) {
            const data = await response.json();
            if (data.isVisible && data.categories.length > 0) {
                document.getElementById("loadingOfflinePage").style.display = "none";
                const catDropdown = document.getElementById("playerCategory");
                catDropdown.innerHTML = '<option value="">ক্যাটাগরি নির্ধারণ করুন</option>';
                data.categories.forEach(cat => {
                    catDropdown.innerHTML += `<option value="${cat.code}">${cat.name}</option>`;
                });
                document.getElementById("startPage").style.display = "block";
            } else {
                document.getElementById("loadingOfflinePage").innerHTML = "<h1>Mission Offline</h1><p>Quiz is currently not available or no categories are active.</p>";
            }
        } else {
            throw new Error("Server error");
        }
    } catch (e) {
        document.getElementById("loadingOfflinePage").innerHTML = "<h1>Error</h1><p>Could not connect to server.</p>";
        console.warn("API error: ", e);
    }
};

async function attemptStartMission() {
    const errorEl = document.getElementById("passwordError");
    const categoryCode = document.getElementById("playerCategory").value;
    const password = document.getElementById("quizPasswordInput").value;
    const pName = document.getElementById("playerName").value.trim();
    const pID = document.getElementById("playerID").value.trim();

    if (!pName || !pID || !categoryCode) {
        errorEl.innerText = "দয়া করে নাম, আইডি এবং ক্যাটাগরি পূরণ করুন। (Fill Name, ID and Category)";
        return;
    }
    if (!password) {
        errorEl.innerText = "Please enter the access code for this category.";
        return;
    }

    errorEl.innerText = "Verifying access code...";

    try {
        const response = await fetch("/api/verify", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({ categoryCode, password })
        });

        if (response.ok) {
            const data = await response.json();
            if (data.success) {
                errorEl.innerText = "";
                startQuiz(); // Correct access code, launch quiz!
                return;
            }
        }

        const errData = await response.json().catch(() => ({}));
        errorEl.innerText = errData.error || "Incorrect password for this category.";

    } catch (e) {
        console.warn(e);
        errorEl.innerText = "API Error. Check network connection.";
    }
}

// START QUIZ
function startQuiz() {
    player.name = document.getElementById("playerName").value;
    player.id = document.getElementById("playerID").value;
    player.category = document.getElementById("playerCategory").value || "N/A";

    document.getElementById("startPage").style.display = "none";
    document.getElementById("quizPage").style.display = "block";

    document.getElementById("playerInfo").innerText =
        `Name: ${player.name} | ID: ${player.id} | Category: ${player.category}`;

    // Select questions based on category
    let questionsToUse;
    if (player.category === "NCO_Course") {
        questionsToUse = NCOCourseQuestions;
    } else if (player.category === "JCO_Course") {
        questionsToUse = JCOCourseQuestions;
    } else if (player.category === "SNK") {
        questionsToUse = SNKCourseQuestions;
    }else if (player.category === "MAG") {
        questionsToUse = magQuestions;
    }

    selectedQuestions = shuffleArray([...questionsToUse]).slice(0, 20);

    current = 0;
    score = 0;

    loadQuestion();
}

// LOAD QUESTION
function loadQuestion() {
    let q = selectedQuestions[current];
    hasAnswered = false;

    document.getElementById("question").innerText = q.question;
    document.getElementById("progress").innerText =
        `Question: ${current + 1} / ${selectedQuestions.length}`;

    let optionsHTML = "";
    q.options.forEach((opt, index) => {
        optionsHTML += `<div class="option" onclick="selectAnswer(${index})">${opt}</div>`;
    });

    document.getElementById("options").innerHTML = optionsHTML;
    document.getElementById("result").innerText = "";

    startTimer();
}

// SELECT ANSWER
function selectAnswer(choice) {
    if (hasAnswered) {
        return;
    }
    hasAnswered = true;

    clearInterval(timer);
    let q = selectedQuestions[current];
    let options = document.querySelectorAll(".option");

    options.forEach((opt, index) => {
        if (index === q.correct) {
            opt.classList.add("correct");
        } else if (index === choice) {
            opt.classList.add("wrong");
        }
    });

    if (choice === q.correct) {
        score++;
        if (correctSound) {
            correctSound.play().catch(() => { });
        }
        document.getElementById("result").innerText =
            "✅ Correct! " + q.explanation;
    } else {
        if (wrongSound) {
            wrongSound.play().catch(() => { });
        }
        document.getElementById("result").innerText =
            "❌ Wrong! " + q.explanation;
    }

    document.getElementById("score").innerText = "Score: " + score;
}

// NEXT QUESTION
function nextQuestion() {
    current++;
    if (current >= selectedQuestions.length) {
        endQuiz();
        return;
    }
    loadQuestion();
}

// TIMER
function startTimer() {
    time = Time;
    const timerEl = document.getElementById("timer");
    timerEl.classList.remove("low-time");
    timerEl.innerText = "Time: " + time;

    timer = setInterval(() => {
        time--;
        timerEl.innerText = "Time: " + time;

        if (time <= 3) {
            timerEl.classList.add("low-time");
        }

        if (time <= 0) {
            clearInterval(timer);
            hasAnswered = true;
            document.getElementById("result").innerText = "⏱ Time Up!";
        }
    }, 1000);
}


// END QUIZ
async function endQuiz() {
    clearInterval(timer);
    document.getElementById("quizPage").style.display = "none";
    document.getElementById("leaderboardPage").style.display = "block";
    document.getElementById("leaderboard").innerHTML = "<p>Submitting score...</p>";
    await updateLeaderboard();
}

function renderLeaderboard(scoresData) {
    let html = "<h3>Top 5 Scores</h3><ol>";
    if (scoresData && scoresData.length > 0) {
        scoresData.forEach(p => {
            html += `<li>${p.name} (${p.category}) - ${p.score}</li>`;
        });
    } else {
        html += "<li>No scores yet</li>";
    }
    html += "</ol>";

    document.getElementById("leaderboard").innerHTML = html;
}

// LEADERBOARD
async function updateLeaderboard() {
    try {
        const res = await fetch("/api/scores", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({
                action: "submit",
                name: player.name,
                id: player.id,
                category: player.category,
                score: score
            })
        });
        const data = await res.json();
        if (data.success && data.topScores) {
            renderLeaderboard(data.topScores);
        } else {
            document.getElementById("leaderboard").innerHTML = "<p>Error loading leaderboard</p>";
        }
    } catch (e) {
        document.getElementById("leaderboard").innerHTML = "<p>Network error while saving score</p>";
    }
}

// RESTART
function restartQuiz() {
    location.reload();
}

// SHUFFLE
function shuffleArray(array) {
    for (let i = array.length - 1; i > 0; i--) {
        let j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}
