const SNKCourseQuestions = [
    {
        level: "SNK",
        question: "দিনের বেলা আক্রমণের বিন্যাস পাশাপাশি সেকশনের মধ্যবর্তী দূরত্ব কত গজ।",
        options: ["২৫ গজ।", "৫০ গজ।", "৫৫ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এফএসলন গাড়ীতে কি থাকে।",
        options: ["প্রথম সারির রিজার্ভ এ্যামোঃ", "খাবার।", "৫৫ গজ।", "৭৫-১০০ গজ।"], 
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণে এফএসলন নেতৃত্বে কে থাকে?",
        options: ["সিএসএম।", "সিকিউএমএস।", "বিকিউএমএস।", "কোত এনসিও।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "নিরাপত্তা সেকশন অধিনায়ক কত গজের মধ্যে ২/৩ টি ক্ষুদ্র রণকৌশলগত গুরুত্বপূর্ণ ভূমি দখলের মাধ্যমে বিন্যাস ভূমির নিরাপত্তা নিশ্চিত করেন।",
        options: ["১০০-২০০ গজ।", "২০০-৩০০ গজ।", "৩০০-৪০০ গজ।", "৪০০-৫০০ গজ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে রেকী সাধারণত কিসের উপর করা হয়।",
        options: ["ভূমি।", "স্কেচ।", "ম্যাপ।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে একটি পদাতিক ব্যাটালিয়নের জন্য যাত্রাস্থলের নিরাপত্তার দায়িত্বে কে থাকে।",
        options: ["১টি গভীরের কোম্পানী।", "১টি গভীরের কোম্পানী ১টি গভীরের প্লাটুন।", "১টি অনুসরণকারী সেকশন।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে রণকৌশলগত গুরুত্বপূর্ণ ভূমি দখলে নেওয়া কার কাজ।",
        options: ["মোবাইল ট্রুপস্", "প্লাংক গার্ড।", "ভ্যান গার্ড।", "এ্যাডভান্স গার্ড।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে উভয় পাশের তল্লাশি বিস্তৃতি কত গজ?",
        options: ["১৫০-৩০০ গজ।", "২০০-৩০০ গজ।", "১৫০-২৫০ গজ।", "২৫০-৩০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে অক্ষে স্কাউটগণ পয়েন্ট সেকশন হতে কতগজ আগে চলে।",
        options: ["৭৫-১৫০ গজ।", "৭৫-১০০ গজ।", "১৫০-২৫০ গজ।", "২৫০-৩০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতের আক্রমণে একটি প্লাটুনের বিস্তৃতি কত গজ?",
        options: ["২৫-৩০ গজ।", "৫০-১০০ গজ।", "৫৫-১০০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোম্পানী পর্যায়ে বিন্যাস ভূমি চিহ্নিত করণ দলের জনবল কতজন?",
        options: ["০৮ জন।", "২৮ জন।", "১২ জন।", "১৬ জন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চূড়ান্ত মিলনস্থানে সর্বপ্রথম কোন দল যাত্রা করবে।",
        options: ["বিচ্ছিন্নকারী দল", "আবরণী দল।", "সংরক্ষিত দল।", "কার্যকরী দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন চিকিৎসার সহায়তার জন্য দায়িত্ব প্রাপ্ত থাকে।",
        options: ["এডিএস।", "এমডিএস", "মেডিক্যাল ইউনিট।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন দলের কমান্ডার হিসেবে থাকেন।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কাট-আপ পার্টি", "এ্যাকশন পার্টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণকারী সেনা দলের সহায়তার জন্য বিন্যাস ভূমি থেকে কত ডিড্রী কোণে ফায়ার বেস স্থাপনা করা হয়।",
        options: ["৪৫ ডিগ্রী।", "৯০ ডিগ্রী।", "৮০ ডিগ্রী।", "কোনটিই নয়।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "যদি পর্যাপ্ত ফায়ার সমর্থন এবং ভূমি আকস্মিকতা অর্জনের সহায়তা করে তবে এই আক্রমণ পরিচালনা করা যাবে।",
        options: ["স্বশব্দ আক্রমণ।", "নিঃ শব্দে আক্রমণ", "দ্বিতীয় আক্রমণ", "ভোরের আক্রমণ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ধ্বংসাত্বক পর্বে প্লাটুন ও সেকশনের স্তরে কয়টি মূলনীতি রয়েছে।",
        options: ["০৩ টি।", "০৫ টি।", "০৭ টি।", "০৯ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের দল বিন্যাসের ভারসাম্যতা বজায় রাখার জন্য দলবিন্যাস নিম্নের কোন বিষয়ের উপর নির্ভরশীল নয়।",
        options: ["উদ্দেশ্য।", "মনোবল", "ভূমির অবস্থা।", "শত্রুর বাধার ক্ষমতা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আরপি সেকশনের লোক নিয়োগ কে করে থাকে।",
        options: ["অধিনায়ক", "এ্যাডজুটেন্ট", "উপ-অধিনায়ক", "নিরাপত্তা অফিসার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিনের বেলা আক্রমণে বিন্যাস ভূমিতে পাশাপাশি সেকশনের মধ্যবর্তী দূরত্ব কত।",
        options: ["২৫ গজ।", "৫০ গজ।", "৫৫ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোম্পানী পর্যায়ে বিন্যাস ভূমি চিহ্নিত করণ দলের সংগঠন।",
        options: ["২৮ জন।", "১২ জন।", "০৮ জন।", "১৬ জন।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতে আক্রমণে একটি প্লাটুনের বিন্যাস ভূমির বিস্তৃতি।",
        options: ["২৫-৩০ গজ।", "৫০-১০০ গজ।", "৫৫-১০০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণে সময় কেউ হতাহত হলে সেখান থেকে সংগ্রহ করে কে?",
        options: ["সিকিউএমএস", "আক্রমণের সময়", "আক্রমণের পর", "অনুসরণকারী দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘকালীন হানার লক্ষ্যবস্তু কোনটি।",
        options: ["প্রধান কার্যলয়।", "টেলিফোন।", "যুদ্ধবন্দী।", "বিদুৎ শক্তি উৎপাদন কেন্দ্র।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্বল্পকালীন হানার লক্ষবস্তু কোনটি।",
        options: ["সেতু।", "রেল যোগাযোগ ব্যবস্থা।", "শত্রুর গান পজিশন।", "বিদুৎ শক্তি উৎপাদন কেন্দ্র।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চুড়ান্ত মিলনস্থান সর্ব প্রথম কোন দল যাত্রা করবে।",
        options: ["বিচ্ছিন্নকারী দল।", "আবরণী দল।", "কার্যকরী দল।", "সবচেয়ে দূরের দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর সম্ভাব্য পথ, শত্রুর অভ্যাস এবং শত্রু দ্বারা সৃষ্ট শব্দ নিরীক্ষণ করা কোন টহলের কাজ।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ", "জংগী।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন পার্টি কমান্ডার হিসেবে কাজ করে।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কার্ট আপ পার্টি।", "এ্যাকশন পার্টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সতর্কতা হানার কোন বিষয়ক সহায়ক।",
        options: ["আকস্মিকতা", "নিয়ন্ত্রণ।", "মনোবল।", "নিরাপত্তা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্টফ ফায়ার আদেশের সাথে সাথে হোল্ডিং পার্টি বিশ্রাম এলাকা ফায়ার",
        options: ["চালিয়ে যাবে", "বন্ধ রাখবে", "এ্যাকশন পার্টির সাথে মিশে যাবে", "কোনটিই নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এয়ার ফটোকে সাধারণত কয় শ্রেণীতে ভাগ কর যায়।",
        options: ["১", "২", "৩", "৪"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রবল বাতাস চেনার উপায় কোনটি।",
        options: ["৬ হতে ১০ মিটার।", "৮ হতে ১২ মিটার।", "৪ হতে ১২ মিটার।", "৮ হতে ১০ মিটার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যম বাতাস চেনার উপায় হলো প্রতি সেকেন্ডে বাতাসের গতি কত।",
        options: ["৬ হতে ১০ মিটার।", "৮ হতে ১২ মিটার।", "৪ হতে ৭ মিটার।", "৮ হতে ১১ মিটার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দুষিত এলাকায় চিহ্নিত করণে কি রং ব্যবহার করা হয়।",
        options: ["লাল", "হলুদ", "সাদা", "কালো"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সঠিক দূরত্ব নির্ণয়ের সুবিধার্থে দায়িত্বপূর্ণ এলাকাকে মোট কয়টি অংশে ভাগ করা হয়।",
        options: ["২", "৪", "৫", "৩"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর সম্ভাব্য আগমণের নজর রাখা কোন টহলের কাজ।",
        options: ["স্থির ওপি প্রদান করে।", "দন্ডায়মান টহল", "পর্যবেক্ষণ চৌকি।", "দৃশ্যমান স্থান।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা পরিচালনার জন্য কার্যকরী দল কয়টি উপদলের সমন্বয়ে গঠিত হয়।",
        options: ["৪টি।", "৫টি।", "৩টি।", "৬টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের সময় সকল অস্ত্রের পাল্লা কত লাগাতে হবে।",
        options: ["৩০০ গজ।", "২০০ গজ।", "৫০০ গজ।", "১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শহর এলাকার আক্রমণকে কয়টি পর্বে ভাগ করা যেতে পারে।",
        options: ["৩", "৪", "৬", "২"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অনুপবেশ কয়টি উপায়ে করা যায়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিনের ফাঁদে নির্ভরশীল হিসাবে কী নিয়োগ করা যেতে পারে।",
        options: ["স্নাইপার।", "রাইফেল।", "এলএমজি।", "মর্টার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার সংবাদ সংগ্রহের মাধ্যমে কোনটি।",
        options: ["মানচিত্র", "এয়ার ফটো।", "যুদ্ধবন্দী।", "উপরের সবগুলি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "নিরাপদ চিহ্ন গুপ্তাশ্রয় হতে কত দূরত্বে স্থাপন করা হয়।",
        options: ["৩০০ গজ।", "৫০০ গজ।", "৩০০-৪০০ গজ।", "৩০০-৫০০ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যমা আঙ্গুল থেকে কনিষ্ট আঙ্গুল পর্যন্ত কত ডিগ্রি।",
        options: ["৫", "৩", "২", "৭"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "এ্যাগবাটিসের (গাছের একাংশ ফেলে) মাধ্যমে সৃষ্ট সড়ক প্রতিবন্ধকতা কত ডিগ্রি কোনে শত্রুর আগমনী পথ স্থাপন করা হয়।",
        options: ["৫০ ডিগ্রি।", "৪৫ ডিগ্রি।", "৬০ ডিগ্রি।", "৯০ ডিগ্রি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুন মোতায়েন নিরাপত্তা দলের অংশ নয় কোনটি।",
        options: ["আবরণী দল।", "পশ্চাৎ দল।", "পার্শ্বরক্ষীদল।", "পরিকল্পনা দল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রভিযানে প্লাটুন সদরে আহতদের প্রয়োজনীয় চিকিৎসা প্রদানের পর কোথায় পৌছানো হয়।",
        options: ["এমডিএস।", "সি এশিএ", "এডিএস", "সিএমএইচ।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণকারী সেনাদলের সহায়তার জন্য বিন্যাসভূমি হতে কত ডিগ্রি কোণে ফায়ার বেস স্থাপন করা হয়।",
        options: ["৪৫ ডিগ্রি।", "৬০ ডিগ্রি।", "১৮০ ডিগ্রি।", "৯০ ডিগ্রি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাতের আক্রমণে বিন্যাস ভূমিতে ব্যক্তি হতে ব্যক্তির দূরত্ব কত হবে।",
        options: ["৩-৫ গজ।", "২-৪ গজ।", "৪-৫ গজ।", "২-৩ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দিবা আক্রমণে বিন্যাস ভূমিতে ব্যক্তি থেকে ব্যক্তির দূরত্ব কত হবে।",
        options: ["২-৩ গজ।", "২-৩ মিটার।", "৪-৫ গজ।", "৫ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানের সময় শত্রু গোলাগুলি করতে শুরু করলে সাধারণত কেউ কত গজের বেশী দৌড়াবেনা।",
        options: ["৫ গজ।", "১ গজ।", "১৫ গজ।", "২০ গজ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণের সময় মাইন ফিল্ডের মধ্যে দিয়ে অতিক্রম করার সময় শতকরা কত ভাগ হতাহত সম্ভাবনা থাকে।",
        options: ["২০ শতাংশ", "১০ শতাংশ", "৫ শতাংশ", "৩০ শতাংশ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সেকশন অধিনায়কে কয়টি বিষয়ে পারদর্শী হতে হবে।",
        options: ["৫টি।", "৩টি।", "৪টি।", "৬টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহলের উদ্দেশ্য কয়টি।",
        options: ["৪টি।", "৫টি।", "৬টি।", "৭টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহল কত প্রকার।",
        options: ["৩ প্রকার।", "১ প্রকার।", "৪ প্রকার", "২ প্রকার।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "লক্ষ্যবস্তুর উপর ভিত্তি করে কয় প্রকারে পর্যবেক্ষণ সম্পাদন করা হয়ে থাকে।",
        options: ["২ প্রকার।", "৩ প্রকার।", "৪ প্রকার", "৫ প্রকার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা কার্য সম্পাদান করা কোন টহলের কাজ।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ", "জংগীটহল।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহলের পর্ব কয়টি।",
        options: ["৩টি।", "৪টি।", "৫টি।", "৬টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কয়টি বিশেষ উপাদানের উপর নির্ভর করে ফর্মশকে মেনে চলতে হবে।",
        options: ["৪টি", "৫টি।", "৬টি", "৭টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কয়টি বিশেষ উপাদানের উপর নির্ভর করে ফর্মশকে মেনে চলতে হবে।",
        options: ["৪টি", "৫টি", "৬ টি", "৭ টি"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চুড়ান্ত মিলনস্থান পৌঁছার কত গজ পূর্বে মূল দলকে স্বল্পকালীন বিরতির সংকেত দিতে হবে।",
        options: ["৩০০ গজ।", "২০০ গজ।", "৪০০ গজ।", "৫০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অধিনায়ক তার অপারেটরসহ চূড়ান্ত মিলনস্থান থেকে কত গজ দূরে অবস্থান করবে।",
        options: ["৫০-১০০ গজ।", "৭০-১০০ গজ।", "৫০-৮০ গজ।", "৭৫-১০০ গজ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জটিল পদ্ধতি লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৩ টি।", "৪ টি।", "৫ টি।", "৬ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা কার্যক্রম সাধারণত কতক্ষণ।",
        options: ["৪-৫ মিনিট।", "৩-৪ মিনিট।", "৫-৬ মিনিট।", "২-৩ মিনিট স্থায়ী হয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সেকশন ব্যাটেল ড্রিল।",
        options: ["৪ টি।", "৩ টি।", "৫ টি।", "৬ টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সময়ের উপর ভিত্তি করে আক্রমণ কত প্রকার।",
        options: ["৪ প্রকার।", "৩ প্রকার।", "৫ প্রকার।", "৬ প্রকার।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৩টি।", "২টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জটিল পদ্ধতিতে লক্ষ্যবস্তু দেখানোর পদ্ধতি কয়টি।",
        options: ["৫ টি।", "৪ টি।", "৩ টি।", "৬ টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় এফডিএল থেকে আহত সৈনিককে সিএপিতে নিয়ে আসা কার কাজ।",
        options: ["প্লাটুন কমান্ডার।", "কোম্পানী এস জেসিও।", "সেকশন কমান্ডার।", "প্লাটুন সার্জেন্ট।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় এমজি এবং আর আর অবস্থান কে নির্ধারণ করবে।",
        options: ["প্লাটুন কমান্ডার।", "কোম্পানী কমান্ডার।", "ব্যাটালিয়ন কমান্ডার।", "ব্রিগেড কমান্ডার।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষায় শত্রুর শেল বা গুলি লাগলে সাথে সাথে কি করতে হবে।",
        options: ["আরএপিতে নিতে হবে।", "মেল ড্রেসিং/ফিল্ড ড্রেসিং দিতে হবে।", "মরফিয়া দিতে হবে।", "সিএপিতে পাঠাতে হবে।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "বস্তু খো যাওয়ার কারণ কয়টি।",
        options: ["৭টি।", "৫টি।", "৬টি।", "৮টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সঠিক দূরত্ব নির্ণয়ের সুবিধার্থে দায়িত্বপূর্ণ এলাকাকে কয়টি ভাগে ভাগ করা হয়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফাঁদের লুক আউটম্যানের কাজ কয়টি।",
        options: ["৩টি।", "৪টি।", "৫টি।", "৬টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শ্রবণ চৌকির জনবল সাধারণ।",
        options: ["২-৩ জন।", "১-২ জন।", "৩-৪ জন।", "৪-৫ জন।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘ কালীন হানার লক্ষবস্তু কয়টি?",
        options: ["৫টি।", "৬টি।", "৭টি।", "৮টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "মধ্যখানের ভূমি কত মিটার?",
        options: ["৩০০-৫০০", "৩০০-৪০০", "৪০০-৫০০", "২০০-৩০০"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রাস্তা অতিক্রমে ব্যবহার করা হয়।",
        options: ["বানর চাল।", "চিতা চাল।", "গড়ান চাল।", "হাঁটা চাল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফাঁদ এলাকা হতে লুক আউটম্যানের অবস্থান।",
        options: ["২ কিঃ মিঃ।", "৩ কিঃ মিঃ।", "২-৩ কিঃ মিঃ।", "৪ কিঃ মিঃ।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর অবস্থান নির্ণয় করার পদ্ধতি কয়টি।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফার্মবসে বা শক্ত ঘাটির দল।",
        options: ["৩", "৪", "৬", "২"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আক্রমণের পর্ব কয়টি।",
        options: ["২ টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "তর্জনী থেকে মধ্যমা আঙ্গুল কত ডিগ্রি?",
        options: ["২ ডিগ্রী।", "৩ ডিগ্রী।", "৪ ডিগ্রী।", "৫ ডিগ্রী।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন বাস্তাবায়নে ধাপ কয়টি।",
        options: ["২টি।", "৬টি।", "৩টি।", "৫টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষা একটি প্লাটুনের গভীরতা কত মিটার?",
        options: ["১০০ মিটার।", "২০০ মিটার।", "৩০০ মিটার।", "৪০০ মিটার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রু পাল্টা ফাঁদ প্রতিহত করা কোন দলের কাজ।",
        options: ["বিচ্ছিন্নকারী দল।", "আবরণী দল।", "প্রধান দল।", "সংরক্ষিত দল।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "আলোতে নিজস্ব প্রতিরক্ষায় অথবা মাইনফিল্ড পরিখা করা।",
        options: ["প্রথম এবং শেষ।", "দ্বিতীয় এবং চতুর্থ।", "প্রথম এবং চতুর্থ।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চৌকস সেনাদল কতটি ফিল্ড সংকেত ব্যবহার করা যাবে।",
        options: ["০৫", "০৭", "০৪", "০৩"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কতো মিটার দূরের সৈনিকের চেহারা অন্ধকারে দেখা যায়।",
        options: ["৫০০", "৩০০", "৮০০", "৯০০"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "অগ্রাভিযানে পয়েন্ট সেকশন তল্লাশি বিস্তৃতি কত গজ।",
        options: ["২০০-৫০০ গজ।", "১০০-৩০০ গজ।", "১৫০-৩০০ গজ।", "৩০০-৫০০ গজ।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "জলাধারে নিকট কখন কী করা উচিত না।",
        options: ["ভীড়।", "কাছাকাছি যাওয়া।", "বসে থাকা।", "ধাকাধাকি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "শত্রুর গান পজিশন কী হানার লক্ষ্যবস্তু।",
        options: ["দীর্ঘকালীন হানা।", "স্বল্পকালীন হানা।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "চূড়ান্ত মিলনস্থানে পৌঁছার কত গজ পূর্বে মূলদলকে বিরতী সংকেত দিক।",
        options: ["৫০০", "৩০০", "৪০০", "২০০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফায়ার নিয়ন্ত্রণ আদেশ পর্যায়ক্রমে ইংরেজীতে কী ওয়ার্ড।",
        options: ["GRLT", "GRIT", "CLAP", "GPLT"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রতিরক্ষা একটি প্লাটুনের বিস্তৃতি কতো মিটার।",
        options: ["৫০০ মিটার।", "৪০০ মিটার।", "৩০০ মিটার।", "২০০ মিটার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "গুপ্তাশ্রয় শত্রুর অবস্থান থেকে কত মাইন দূরে হওয়া ভালো।",
        options: ["৩ মাইল", "৫ মাইল।", "৪ মাইল।", "৬ মাইল।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হাত অথবা হাটুর সাহায্যে কি চাল ব্যবহার করা যায়।",
        options: ["বানর।", "হাটা।", "চিতা।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কত মিটার দূরের সৈনিকের চেহারা চেনা মুসকিল।",
        options: ["৫০০ মিটার।", "৪০০ মিটার।", "২০০ মিটার।", "১০০ মিটার।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "প্রহরী সাথে যোগাযোগ এর মাধ্যম কয়টি?",
        options: ["৬টি।", "৮টি।", "৩টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পর্যবেক্ষণ শ্রবণ চৌকির দায়িত্ব ও কর্তব্যগুলি কয়টি?",
        options: ["৫ টি", "৮টি।", "৪টি।", "২টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সময় ওপর ভিত্তি করে আক্রমণ কত প্রকার।",
        options: ["২ প্রকার।", "৩ প্রকার।", "৪ প্রকার।", "৫ প্রকার।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা শেষে কয়টি বিষয় প্রতিবেদন দেওয়া হয়।",
        options: ["৮ টি।", "৭টি।", "৬টি।", "৯টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "স্কাউট এর দায়িত্ব কর্তব্য কয়টি?",
        options: ["৬টি।", "৭টি।", "৮টি।", "৯টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "টহল সংগঠন প্রভাব বিস্তার উপাদান কয়টি।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "সংকেত কয়ভাবে দেওয়া যায়।",
        options: ["৩", "৫", "৮", "৯"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুনঃমোতায়েন সবসময় কিসের আশংকা থাকে।",
        options: ["জংঙ্গী টহল।", "অনুপ্রবেশ।", "আক্রমণের।", "কোনটিই নয়।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "রণকৌশলগত পুণঃমোতায়েন রিলিজ পয়েন্ট স্থাপনের কোন দলের কাজ।",
        options: ["পর্যবেক্ষণ দল।", "নিরাপত্তা দল।", "পশ্চাদ দল।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানার উপ-অধিনায়ক কোন পার্টির কমান্ডার হিসাবে থাকেন।",
        options: ["হোল্ডিং পার্টি।", "কভারিং পার্টি।", "কাট আপ পার্টি।", "এ্যাকশন পার্টি।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোন টহল গোপনে সংবাদ গ্রহণ করে।",
        options: ["নিরাপত্তা।", "দন্ডায়মান।", "পর্যবেক্ষণ।", "জংঙ্গী।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "দীর্ঘকালীন হানার লক্ষবস্তু কোনটি।",
        options: ["গোয়েন্দা সংস্থা।", "বিদ্যুৎ শক্তি উৎপাদান কেন্দ্র।", "আরআর স্টেশন।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হানা পরিচালনা পূর্বে সংবাদ সংগ্রহ উৎস কয়টি?",
        options: ["৩টি।", "৪টি।", "৫টি।", "৮টি।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "তর্জনী আঙ্গুল থেকে মধ্যমা আঙ্গুল পর্যন্ত কত ডিগ্রি।",
        options: ["২", "৩", "৪", "৫"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ছাড়শব্দের কয়টি অংশ থাকে।",
        options: ["২", "৪", "৬", "৫"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কত মিটার দূরের সৈনিক এর মাথা ইংরেজী ফুলস্টফ এর মতো দেখা যায়।",
        options: ["৫০০", "৬০০", "৭০০", "৮০০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফিল্ড সিগন্যাল কয়টি জিনিসের মাধ্যমে দেয়া হয়।",
        options: ["২টি।", "৩টি।", "৪টি।", "৫টি।"],
        correct: 1,
        explanation: ""
    },
    {
        level: "SNK",
        question: "ফায়ার অবস্থান ঠিক করার জন্য কোনটি সম্পর্কে জ্ঞান থাক দরকার।",
        options: ["অস্ত্রের বৈশিষ্ট্য।", "ভূমির ব্যবহার।", "আবহাওয়া।", "কওখ।"],
        correct: 3,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পার্বত্য চট্টগ্রাম কত সালে শান্তি চুক্তি স্বাক্ষরিত হয়।",
        options: ["১৯৯১।", "১৯৯৬।", "১৯৯৭।", "১৯৯৮।"],
        correct: 2,
        explanation: ""
    },
    {
        level: "SNK",
        question: "পাঁচ সেকেন্ড ব্যবধানে দুইটি লম্বা বাঁশি কিসের সংকেত।",
        options: ["শত্রুর বিমান আক্রমণ শেষ।", "ভূমিতে নামা।", "শত্রুর বিমান।", "কোনটিই নয়।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "হাত খুলে তালু নীচের দিকে রেখে দুই বা তিনবার উঠা নামা করা কিসের সংকেত।",
        options: ["থামা।", "তাড়াতাড়ি কর।", "শায়িত অবস্থায় যাও।", "লাইন কর।"],
        correct: 0,
        explanation: ""
    },
    {
        level: "SNK",
        question: "কোনগুলো অস্থায়ী সড়ক প্রতিবন্ধকতা।",
        options: ["কংক্রিট সিলিন্ডার।", "ভাটিক্যাল রেল।", "বেল্টরেল।", "উপরের সবগুলো।"],
        correct: 3,
        explanation: ""
    }
];

const NCOCourseQuestions = [
    {
        level: "NCO",
        question: "মূল প্রতিরক্ষায় প্লাটুনের কাজ নয় কোনটি?",
        options: ["খনন করা", "সেকশন অধিনায়কের পায়া নির্দেশিকা তৈরি করা", "যোগাযোগ স্থাপন করা", "মাইন লাগানো"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যে অবস্থান থেকে অস্ত্র ফায়ার করার সময় শত্রু ফায়ার হতে আড় পায়া এবং নিরাপদ থাকে তাকে কি অবস্থান বলে?",
        options: ["এনফিলেড", "বিচ্ছুরণ", "ডেফিলেটেড", "কোনটিই নয়"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষা এসটিএলএ এফ অংগ নষ্ট হয়ে গেলে প্লাটুন অধিনায়কের এর কর্তব্য কি?",
        options: ["গভীরের সেকশন থেকে অস্ত্র এনে ঐ স্থানে স্থাপন করা", "কোম্পানী অধিনায়কের আদেশের জন্য অপেক্ষা করা", "উপরের সবগুলো", "কোনটিই নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্লাটুন সদরের টেলিফোনে সব সময় লোক রাখতে হয়। ইহা নিশ্চিত করা কার কাজ?",
        options: ["প্লাটুন সার্জেন্টের", "প্লাটুন কমান্ডারের", "সেকশন কমান্ডারের", "উপরের সবগুলো"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষায় নিরাপত্তামূলক বা রক্ষাকারী অপনল (Protective Detachment) নয় কোনটি?",
        options: ["পর্যবেক্ষণ দল", "সংরক্ষিত দল", "অগ্রবর্তী অবস্থান", "পল্ট"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষার সমাগম এলাকায় প্লাটুন সার্জেন্টের ব্রীফিং এ সমান্য নির্দেশাবলী তে কোন বিষয়টি উল্লেখ করতে হয়?",
        options: ["প্রতিরক্ষা অবস্থান গ্রহণের সময়", "প্রতিরক্ষা অবস্থান শেষ করার সময়", "ওপি পাঠানোর সময়", "ক ও খ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষার ক্ষেত্রে, নিচের কোনটি সবচেয়ে ছোট সংগঠন যা একটি চতুর্মুখী প্রতিরক্ষা নিতে পারে?",
        options: ["সেকশন", "প্লাটুন", "কোম্পানী", "কোনটি নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্লাটুন অধিনায়কের দেয়া সময় ও স্থান অনুযায়ী প্লাটুন অদেশ দলের যখন নিশ্চিত করা কার দায়িত্ব?",
        options: ["সেকশন অধিনায়ক", "প্লাটুন সার্জেন্ট", "আর এল মাল", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রচণাত্মক যুদ্ধ কয়টি পর্যায়ে সম্পন্ন হয়?",
        options: ["৪ টি", "৩ টি", "৬ টি", "২ টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রচণাত্মক ফায়ার তলব করতে হলে নিম্নলিখিত কোন তথ্যটি দিতে হবে না?",
        options: ["শত্রু সংখ্যা", "শত্রুর অবস্থান, একটি গ্রিড সূত্র", "শত্রু কি করছে", "কখন তাদের দেখা গেছে"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রতিরক্ষায় একটি সেকশনের বিকল্প অবস্থান মূল অবস্থান হতে সাধারণত কত দূরত্বে হওয়া উচিত?",
        options: ["২০০-৩০০ গজ", "২৫০-৩৫০ গজ", "১৫০-২০০ গজ", "৩০০-৪০০ গজ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যে ফায়ারের বিটোন জোন এবং শসসেনার অক্ষ মিলে যায় তাকে কি বলে?",
        options: ["এনফিলেড ফায়ার", "ডেফিলেটেড অবস্থান", "প্রতিছেদ রেখা", "পাল্টা আক্রমণ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "প্রস্তুতি অনুসারে শত্রুর সংস্পর্শে না থাকলে নিজ পছন্দমতো স্থানে প্রস্তুত করা প্রতিরক্ষা অবস্থানকে কি বলা হয়?",
        options: ["তড়িৎ প্রতিরক্ষা", "সুপরিকল্পিত প্রতিরক্ষা", "সংগঠিত চতুর্মুখী প্রতিরক্ষা", "অবস্থিত চতুর্মুখী প্রতিরক্ষা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সম্প্রসারিত প্রতিরক্ষার ক্ষেত্রে গভীরতা কিভাবে অর্জন করা হয়?",
        options: ["মাইন ফিল্ড স্থাপনের মাধ্যমে", "প্রতিরক্ষা ফায়ারের মাধ্যমে", "বিকল্প অবস্থান দখলের মাধ্যমে", "পর পর কয়েকটি প্রস্তুতকৃত অবস্থান দখলের মাধ্যমে"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি তথ্য সংগ্রহের সাধারণ উপায় নয়?",
        options: ["অস্ত্রের বিকল্প স্থান", "টহলের মাধ্যমে", "শেল বা মর্টার প্রতিবেদন", "পথ থেকে প্রহরী কর্তৃক পর্যবেক্ষণ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েন কয় ধাপে করা উচিত?",
        options: ["১ টি", "৩ টি", "৪ টি", "৫ টি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি রণকৌশলগত পুনঃমতায়েনের মৌলিক বিবেচ্য বিষয় নয়?",
        options: ["নিয়ন্ত্রণ", "গ্রীন ব্রেক", "গতি", "নিরাপত্তা", "মনোবল বজায় রাখা"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েনে কোম্পানী পর্যবেক্ষণ দলের সংগঠন:",
        options: ["১৮ জন", "১২ জন", "২০ জন", "২৪ জন"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃ মোতায়েনের কোন ধাপে প্রয়োজনীয় বর্হি, সামগ্রী, যানবাহন পিছে পাঠানো হয়?",
        options: ["১ম ধাপে", "২য় ধাপে", "৩য় ধাপে", "৪র্থ ধাপে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি লুপসে অতিরিক্ত সময় নেয়?",
        options: ["ফিলিং আউট এর সময়", "অবস্থান যে সময়ে সম্পূর্ণ ছেড়ে দেয়া হবে", "রণকৌশলগত পুনঃমতায়নকারী সৈন্যরা যে সময়ে পুরাতন অবস্থানের পিছনে একটি নির্ধারিত রেখা অতিক্রম করবে", "পর্যবেক্ষণ দল ব্যতীত অন্য কেউ যে সময়ের পূর্বে পিছে যাবে না"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "রণকৌশলগত পুনঃমতায়েনের জন্য প্লাটুন মিলসংহন কে নির্ধারণ করে থাকে?",
        options: ["প্লাটুন সার্জেন্ট", "কোম্পানী অধিনায়ক", "প্লাটুন অধিনায়ক", "ব্যাটালিয়ন অধিনায়ক"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোম্পানী প্রতিরক্ষা ক্ষেত্রে রণকৌশলগত পুনঃ মোতায়েনের সময় সাধারণত কি পরিমাণ জঙ্গল পশ্চাদপদ হিসেবে রাখা হয়?",
        options: ["এক সেকশন পরিমাণ", "দুই সেকশন পরিমাণ", "এক প্লাটুন পরিমাণ", "দুই প্লাটুন পরিমাণ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি আক্রমণে পদাতিক প্লাটুনের কাজ নয়?",
        options: ["বিনালব্ধি চিহ্নিত করণ এবং রক্ষণকারী দল", "মূল দল ব্যতীত অন্য যে কোন দলের (দ্বিতীয়, সহায়ককারী আক্রমণ) অংশ", "বিন্যাস ভূমিস্থ শত্রু পর্যবেক্ষণ/শ্রবণ চৌকি অপসারণ", "ফায়ার সমর্থন প্রদান করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাইন ফিল্ড অতিক্রম করার পদ্ধতি নয় কোনটি?",
        options: ["যান্ত্রিক পদ্ধতি", "মাইন উত্তলন করে নিরাপদ পথ তৈরি", "আর্টিলারি গোলা বর্ষণ", "নিরাপদ অথবা অনিরাপদ পথে একসারিতে দ্রুত মাইন ফিল্ড অতিক্রম করা"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণের পর্ব নয় কোনটি?",
        options: ["প্রস্তুতি পর্ব", "গমন পর্ব", "আক্রমণ পর্ব", "ধ্বংসাত্মক পর্ব"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি আক্রমণের মৌলিক বিশেষ বিষয় নয়?",
        options: ["সহজ সংগ্রাহ", "সময় পরিকল্পনা", "দ্রুততা", "উল্লেখ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি আক্রমণে বিন্যাস ভূমিতে করনীয় নয়?",
        options: ["নিরাপত্তা রক্ষাকারী দলের সাথে যোগাযোগ করা", "বেতার যন্ত্র পরীক্ষা ও সমন্বয় সাধন করা", "সৈনিকদের শেষবারের মত লক্ষ্য দেখানো", "অস্ত্রের লেজেন্ট লাগানো", "রণক্ষেত্র জন্য কত মিনিট বাকি আছে তা সকলকে জানানো"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যাত্রা রেখা কি ধরনের হওয়া উচিৎ?",
        options: ["লক্ষ্য বস্তুর সাথে আড়াআড়ি ভাবে বা আক্রমণ অক্ষের সমকোণে হওয়া", "যথা সম্ভব প্রাকৃতিক হওয়া উচিত, একান্ত সম্ভব না হলে সহজে চেনা যায় এমন কৃত্রিম চিহ্ন সম্বলিত হওয়া", "বিনালব্ধি ও যাত্রা রেখার মাঝখানে কোন প্রতিবন্ধক না থাকা", "উপরের সবকটি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণকারী সেনাদল কাছাকাছি কত দূরত্বে পৌঁছালে গোলন্দাজ এবং মর্টারের ফায়ার সমর্থন বন্ধ হয়ে যায়?",
        options: ["২০০-৪০০ গজ", "৩০০-৪০০ গজ", "২০০-৩০০ গজ", "৪০০-৫০০ গজ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "আক্রমণে সম্মুখ সমাবেশ এলাকা বসবার সময় শত্রুর দূরত্ব এবং কোন অস্ত্রের তেজের বাইরে হওয়া উচিৎ?",
        options: ["আর্টিলারী গান", "মর্টার", "এমজি", "মেটিস"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি বসতি এলাকায় যুদ্ধের নীতি নয়?",
        options: ["সহজ পরিকল্পনা", "নিয়ন্ত্রণ", "ভারসাম্য", "সীমিত রেঞ্জ বা পাল্লা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ার নিয়ন্ত্রণ আদেশ দেওয়ার পদ্ধতিকে ইংরেজি কোন শব্দ দ্বারা ব্যক্ত করা হয়?",
        options: ["GRIT", "CLAP", "CLOP", "GRIP"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি ওয়ারের উন্নয়নের অংশ নয়?",
        options: ["প্রহরীর ব্যবস্থা", "বিমূর্ত প্রতিরোধ", "ধ্বংস ও গোপনীয়তা", "ফিল্ড অফ ফায়ার পরিষ্কার করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি ফায়ারবেসের দলের অন্তর্ভুক্ত নয়?",
        options: ["পর্যবেক্ষণ দল", "নিরাপত্তা বা রক্ষী দল", "রেকি/জ্বলী টহল", "আরমরী দল"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি বসতি এলাকার আক্রমণে সেকশন সংগঠনের অংশ নয়?",
        options: ["কমান্ড গ্রুপ", "নিয়ন্ত্রণ গ্রুপ", "এসল্ট গ্রুপ", "আরমরী ফায়ার দল"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ার পরিচালনার সময় নিধন এলাকা থেকে পলায়নরত শত্রুকে প্রতিহত করা কোন দলের কাজ?",
        options: ["কার্যকরী দল", "বাধা প্রদানকারী দল", "সংরক্ষিত দল", "বিচ্ছিন্নকারী দল"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি বসতি এলাকার আক্রমণে আক্রমণকারীর সুবিধা নয়?",
        options: ["শহর পরিকল্পনা (নকশা)", "তৃতীয় মাত্রা (থার্ড ডাইমেনশন)", "অন্ধকারের ব্যবহার", "সীমিত খোলা জায়গা"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "হানা পরিচালনার সময় লক্ষ্যবস্তুতে পৌঁছে বিশেষ অর্থসম্পাদন উপলক্ষ বা লক্ষ্যবস্তু হতে কত দূরে অবস্থান গ্রহণ করে?",
        options: ["১০/১৫ গজ", "২০/৩০ গজ", "৩০/৪০ গজ", "৪০/৫০ গজ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি ক্ষণকালীন হানার লক্ষণসমূহ নয়?",
        options: ["শত্রুর গান পজিশন", "প্রধান কার্যালয়", "টেলিফোন লাইন বা এ্যাডেক্স", "বিদ্যুৎ শক্তি উৎপাদন কেন্দ্র"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মনায় সংবাদ সংগ্রহের উৎস নিরূপণ:",
        options: ["মানচিত্র", "পর্যবেক্ষণ চৌকি", "দূরবীন", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি টহলের উদ্দেশ্য?",
        options: ["শত্রুর সাথে যোগাযোগ বজায় রাখা", "শত্রু দলকে হয়রানি অথবা বিচ্ছিন্ন করা", "শত্রুর নিবারিত অবস্থান, গোলন্দাজ, ট্যাংক, সমর ইত্যাদি ধ্বংস করা", "ক ও খ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফায়ারবেস স্থাপনের উদ্দেশ্য বা লক্ষ্য কি?",
        options: ["শত্রু দলকে হয়রানি না বিচ্ছিন্ন করা", "বিশেষ কোন স্থানে নিজ কার্যবিধির দ্বারা শত্রুকে নৌকা দেওয়া", "কার্য সমাপর পূর্বের লক্ষ্যবস্তু সম্পর্কে অত্রও তথ্য সংগ্রহ করা", "শত্রু এলাকার যুদ্ধাত্ব নির্ভর বহিনীকে নিকটতম প্রশাসনিক সাহায্য প্রদান করা"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "অনিয়ম তান্ত্রিক যুদ্ধে বেগদান দেওয়ার জন্য প্রচুর কি প্রয়োজন?",
        options: ["অর্থের", "গতির", "অস্ত্র ও গোলাবারুদ", "খাবারের"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "অনিয়ম তান্ত্রিক বাহিনীর অধিনায়ক সার্বিক অধিনায়কের নিকট হতে কি ধরনের আদেশ পাবে?",
        options: ["মিশন টাইপ আদেশ", "বিস্তারিত আদেশ", "কোনটি নয়", "ক এবং খ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সাধারণত যে সকল দলগুলি ফায়ারবেসে থাকার প্রয়োজন সেগুলো হচ্ছেঃ",
        options: ["পর্যবেক্ষণ দল, নিরাপত্তা বা রক্ষীদল, রেকি/জ্বলী টহল, প্রশাসনিক দল", "পর্যবেক্ষণ দল, কার্যকরী দল, নিরাপত্তা বা রক্ষীদল, প্রশাসনিক দল", "উপরের সব কটি", "উপরের কোনটি নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যুদ্ধ মিলনস্থলে পৌঁছার কত গজ পূর্বে মূল দলকে কৌশলগত বিরতির সংকেত দিবে?",
        options: ["২০০", "৪০০", "৩০০", "কোনটিই নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "টাকে শিকার টহলের অংশই মূল লক্ষ্যে অস্ত্র সজ্জিত কত জন সৈনিক থাকে?",
        options: ["০৪ জন", "০৬ জন", "০৮ জন", "১০ জন"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "ফারবেস ক্ষণকালীন সময়ের জন্য হতে পারে অথবা দীর্ঘকালীন সময়ের জন্য হতে পারে, যা নির্ভর করবে",
        options: ["যুদ্ধের উদ্দেশ্য, ভূমি ও শত্রুর পরিস্থিতির উপর", "উদ্দেশের উপর", "ভূমি ও শত্রুর উপর", "উপরের কোনটি নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিচের কোনটি ফায়ার টহল নয়?",
        options: ["বিচ্ছিন্কারী টহল (কাট অফ পার্টি)", "সংরক্ষিত টহল (রিজার্ভ পার্টি)", "শত্রুবাদা প্রদানকারী টহল (হেজিং পার্টি)", "আরমরী টহল (কভারিং পার্টি)"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "টহলেকে লভিত করার জন্য এমন নির্দিষ্ট পজিশন নেই তবে যোদ্দেশ্য নিপেক্ষের জায়গা অনুসারে কি দিতে হয়?",
        options: ["আড়াল", "পজিশন", "সেফটি রিং খোলার সময় নির্ধারণ করে", "উপরের সবগুলি"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মনচিত্র পঠনে বাঞ্ছিত দিক কোন কোনটি?",
        options: ["ধ্রুব দিক কোণ", "গ্রিড দিক কোণ", "চৌম্বক দিক কোণ", "উপরের সবগুলি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "দূরত্ব পরিমাপন পদ্ধতিতে সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে ত্রুটির পার্থক্য কতটুকু ধরা করতে হবে?",
        options: ["৫ গজ", "১০ গজ", "৬ গজ", "৪ গজ"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "যখন গ্রিড উত্তর ও গ্রিড উত্তর একই রেখায় অনুসরণ করে তখন উক্ত রেখাকে কি বলে?",
        options: ["এগোনিক লাইন", "প্রাইম মেরিডিয়ান", "অভিসারী লাইন", "স্ট্যান্ডার্ড মেরিডিয়ান"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "জিরোইং এর সময় লক্ষ্যস্থি ভুল দূরীকরণের জন্য ফ্রন্ট সাইট টিপকে বাম থেকে ডানে, অর্থাৎ ঘড়ির কাটার দিকে ঘুরালে:",
        options: ["ফ্রন্ট সাইট টিপ নিচে যায়", "ফ্রন্ট সাইট টিপ উপরে উঠে", "ঘড়ির কাটার দিকে যায়", "কোনটি নহে"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কত দূরের সৈনিকের কাঁধের নিচে পরিক্রমণ পাতলা দেখা যায়? হাত ও পায়ের নাড়া ছাড়া পরিষ্কার দেখা যায়।",
        options: ["২০০ মি:", "৩০০ মি:", "৪০০ মি:", "৫০০ মি:"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "দূরত্ব নির্ণয়ের ক্ষেত্রে বাধা সৃষ্টিকারী পরিস্থিতি কোন টি?",
        options: ["ভূমির গঠন", "আবহাওয়া পরিস্থিতি", "আলো অথবা অন্ধকার সময়", "উপরের সবকটি"],
        correct: 3,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সাংকেতিক চিহ্নের ব্যবহার এর ক্ষেত্রে নিম্নের কোনটি সঠিক নয়?",
        options: ["সবুজ-গাছপালা", "নীল-পানি সংক্রান্ত বস্তু", "বাদামী-সকল প্রকার বনলি ভূমি", "লাল-কনক্রিট নির্মিত বস্তু"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "এক ইঞ্চি মাপে প্রত্যেক দুইটি সমোন্নতি রেখার মধ্যবর্তী উচ্চতা কত?",
        options: ["২০০ ফুট", "১৫০ ফুট", "১০০ ফুট", "৫০ ফুট"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে উচ্চতা প্রদর্শনের জন্য নানা রকমের রং ব্যবহৃত হয়। এক্ষেত্রে লাল রঙের ব্যবহার কতো উচ্চতা প্রকাশ করে?",
        options: ["৩০০০ ফুটের উর্দ্ধে", "২৫০০ ফুটের উর্দ্ধে", "১০০০ ফুটের উর্দ্ধে", "৫০০ ফুটের উর্দ্ধে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে বিন্দু উচ্চতা তির্যকভাবে থাকলে ভুলের পরিমাণ কমপক্ষে কত ফুট?",
        options: ["২", "১০", "১৫", "২০"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাপে আক্ষরিক উচ্চতা কিসের সাহায্যে প্রকাশ করা যায়?",
        options: ["BM ও এর ওপর উচ্চতা লিখে", "r", "সহ এর উচ্চতা লিখে", "BM"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "বিজয় এবং শত্রু সকল প্রকার প্রতিরোধক এবং মাইন ফিল্ড দেখানোর ক্ষেত্রে কি রং ব্যবহার করা হয়?",
        options: ["লাল", "কালো", "সবুজ", "কোনটিই নয়"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোনটি শটিং এর নীতি নয়?",
        options: ["গ্রিপ ক্রাফটের ব্যবহার", "শারীরিক সুস্থতা", "ধৈর্য ও সহিষ্ণুতা", "অন্ত্রে ব্যবহার"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "শটিং এর নীতি কয়টি?",
        options: ["৪টি", "৫টি", "৬টি", "৯টি"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "কোন ইংরেজি শব্দটি প্রহরীর অবশ্যই জানা প্রয়োজন?",
        options: ["TEGALOPPS", "TEGSAPPO", "TEGOLAPPS", "TEGOLAPPSS"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'হাত নিচের দিকে সম্পূর্ণ প্রসারিত করে পিছন থেকে সামনে নিতে হবে' কিসের সংকেত?",
        options: ["থামা", "গতি কমাও", "এগিয়ে চল", "কাছে আসো"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'হাত বরাবর হাত তুলে কনুই ভেঙে ঘন ঘন নাড়া' কিসের সংকেত?",
        options: ["তাড়াতাড়ি কর", "লঙ্গীন করা", "শান্তিত অবস্থায় যাও", "থামা"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'পাঁচ সেকেন্ড ব্যবধানে দুটি লম্ব বাঁশি' কিসের সংকেত?",
        options: ["শত্রুর বিমান আক্রমণ শেষ", "ভূমিতে নামা", "শত্রুর বিমান", "কোনটিই নয়"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "'দুটি ছোট বাঁশি' এটা কিসের সংকেত?",
        options: ["ভূমিতে নামা", "শত্রুর বিমান আক্রমণ শেষ", "বিপদ সংকেত", "শত্রুর শব্দ প্রতিরোধ"],
        correct: 0,
        explanation: ""
    },
    {
        level: "NCO",
        question: "মাজল উপরের দিকে রেখে হাত সম্পূর্ণ উপরে তুলতে হবে। এটা কিসের সংকেত?",
        options: ["কম সংখ্যক শত্রু দেখা যাচ্ছে", "বহু সংখ্যক শত্রু দেখা যাচ্ছে", "কোনো শত্রু দেখা যায় না", "শত্রু শক্তি প্রতিরোধ"],
        correct: 2,
        explanation: ""
    },
    {
        level: "NCO",
        question: "বাউন্ড নির্বাচনের সময় লক্ষণীয় বিষয় সমূহ কি কি?",
        options: ["রাস্তার নিকটে যেন না হয়", "বস্তু দূরত্ব নিকটে যেন না হয়", "শত্রুর দূর নিকটে বা দূরে যেন না হয়", "উপরের সবগুলো"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "পাল্লা নির্দেশিকা প্রস্তুত করার সময় লক্ষণীয় বিষয় সমূহের ক্ষেত্রে অঙ্কিত বস্তু সমূহের নাম ও দূরত্ব লিখার ক্ষেত্রে কোন পদ্ধতি অনুসরণ করতে হবে?",
        options: ["বস্তুর নাম বায়ে এবং দূরত্ব ডানে লিখতে হবে", "বস্তুর নাম ডানে এবং দূরত্ব বায়ে লিখতে হবে", "উপরের সবগুলো", "কোনটি নয়"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "নিশ্বন সংখ্যা মূল্য ম্যাপে কোন অংশে থাকে?",
        options: ["ম্যাপের ঊর্ধাংশে", "ম্যাপের মধ্যাংশে", "ম্যাপের নিম্নভাগে", "ম্যাপের নিম্নংশে"],
        correct: 1,
        explanation: ""
    },
    {
        level: "NCO",
        question: "সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে সঠিক দূরত্বকে কম মনে হয় কেন?",
        options: ["যখন আলো কম অথবা সূর্যের আলো ফায়ারারের চশম উপর পরে", "যখন ফায়ারার ও বস্তুর মধ্যবর্তী স্থানে গ্রেড গ্রাউন্ড উপস্থিত", "দর্শক যখন শোয়া অবস্থায় থাকে", "উপরের কোনটি নয়"],
        correct: 1,
        explanation: ""
    }
];
const JCOCourseQuestions
    = [
        {
            level: "JCO",
            question: "ফায়ার অবস্থান ঠিক করার জন্য সম্পর্কে জ্ঞান থাকা দরকার। এর জন্য কি কি দরকার তা করণীয় কাজের উপর নির্ভর করে।", // [cite: 1379], [cite: 1380]
            options: ["অস্ত্রের বৈশিষ্ট্য।", "ভূমির ব্যবহার।", "আবহাওয়া।", "ক ও খ।"], // [cite: 1381], [cite: 1382], [cite: 1383], [cite: 1384]
            correct: 1,
            explanation: "" // [cite: 1385]
        },
        {
            level: "JCO",
            question: "চাইনিজ স্কোপের ফায়ার সাইট টিপসের সাহায্যে ইকুইপমেন্টসহ একজন সৈনিকের শরীর কত চওড়া দেখা যায়।", // [cite: 1387]
            options: ["৫০ সেমি।", "৫৫ সেমি।", "১৯.৬ ইঞ্চি।", "কোনটিই নয়।"], // [cite: 1388], [cite: 1389], [cite: 1390], [cite: 1391]
            correct: 0,
            explanation: "" // [cite: 1392]
        },
        {
            level: "JCO",
            question: "সেকশন অধিনায়ক ও নিজস্ব সৈনিক যখন শত্রুর উদ্দেশ্য বুঝতে পারে তখন কোন ফায়ার নিয়ন্ত্রণ আদেশ দেয়া হয়।", // [cite: 1394]
            options: ["ব্যক্তিগত ফায়ার নিয়ন্ত্রণ আদেশ।", "সংক্ষিপ্ত ফায়ার নিয়ন্ত্রণ আদেশ।", "অপেক্ষমান ফায়ার নিয়ন্ত্রণ আদেশ।", "সম্পূর্ণ ফায়ার নিয়ন্ত্রণ আদেশ।"], // [cite: 1395], [cite: 1396], [cite: 1397], [cite: 1398]
            correct: 2,
            explanation: "" // [cite: 1399]
        },
        {
            level: "JCO",
            question: "\"ঘাড় বরাবর হাত তুলে কনুই ভেঙে ঘন ঘন নাড়া\" কিসের সংকেত।", // [cite: 1404]
            options: ["তাড়াতাড়ি কর।", "লাইন কর।", "শায়িত অবস্থায় যাও।", "থামা।"], // [cite: 1405], [cite: 1406], [cite: 1407], [cite: 1408]
            correct: 0,
            explanation: "" // [cite: 1409]
        },
        {
            level: "JCO",
            question: "\"পাঁচ সেকেন্ড ব্যবধানে দুইটি লম্বা বাঁশি\" কিসের সংকেত।", // [cite: 1411]
            options: ["শত্রুর বিমান আক্রমণ শেষ।", "ভূমিতে নামা।", "শত্রুর বিমান।", "কোনটিই নয়।"], // [cite: 1412], [cite: 1413], [cite: 1414], [cite: 1415]
            correct: 0,
            explanation: "" // [cite: 1416]
        },
        {
            level: "JCO",
            question: "এক ইঞ্চি মাপে গ্রিড লাইন দ্বারা তৈরীকৃত প্রত্যেকটি বর্গক্ষেত্রই কত গজ বর্গক্ষেত্র।", // [cite: 1418], [cite: 1429]
            options: ["১০০।", "১০০০।", "১০০০০।", "১০০০০০।"], // [cite: 1419], [cite: 1420], [cite: 1421], [cite: 1422]
            correct: 1,
            explanation: "" // [cite: 1423]
        },
        {
            level: "JCO",
            question: "সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে সঠিক দূরত্বকে কম মনে হয় কারণ।", // [cite: 1425]
            options: ["যখন আলো কম অথবা সূর্যের আলো ফায়ারারের চক্ষুর উপর পরে।", "যখন ফায়ারার ও বস্তুর মধ্যবর্তী স্থানে ডেড গ্রাউন্ড অবস্থিত।", "দর্শক যখন শোয়া অবস্থায় থাকে।", "উপরের কোনটি নয়।"], // [cite: 1426], [cite: 1427], [cite: 1428], [cite: 1430]
            correct: 1,
            explanation: "" // [cite: 1431]
        },
        {
            level: "JCO",
            question: "সার্ভিস প্রটেক্টরের রোমার নিম্নের কোন স্কেলের ম্যাপের সাথে ব্যবহার করা যায়?", // [cite: 1436]
            options: ["১:১০০০০০", "১:৫০০০", "১:১০০০001", "১:২৫০০০"], // [cite: 1437], [cite: 1438], [cite: 1439], [cite: 1440]
            correct: 1,
            explanation: "" // [cite: 1441]
        },
        {
            level: "JCO",
            question: "দূরত্বের পরিবর্তন পদ্ধতিতে সঠিক দূরত্ব নির্ণয়ের ক্ষেত্রে দূরত্বের পার্থক্য কতগুণ করতে হবে।", // [cite: 1443]
            options: ["৫ গুণ।", "১০ গুণ।", "৬ গুণ।", "৪ গুণ।"], // [cite: 1444], [cite: 1445], [cite: 1446], [cite: 1447]
            correct: 1,
            explanation: "" // [cite: 1448]
        },
        {
            level: "JCO",
            question: "ফিল্ড সিগন্যাল কয়টি জিনিসের মাধ্যমে দেয়া হয়।", // [cite: 1450]
            options: ["০২ টি।", "০৩ টি।", "০৪ টি।", "০৫ টি।"], // [cite: 1451], [cite: 1452], [cite: 1453], [cite: 1454]
            correct: 1,
            explanation: "" // [cite: 1455]
        },
        {
            level: "JCO",
            question: "কত দূরের সৈনিকের কাঁধের নিচে পর্যায়ক্রমে পাতলা দেখা যায়। হাত ও পায়ের নাড়া ছাড়া পরিষ্কার দেখা যায়।", // [cite: 1457]
            options: ["২০০ মি।", "৩০০ মি।", "৪০০ মি।", "৫০০ মি।"], // [cite: 1458], [cite: 1459], [cite: 1460], [cite: 1461]
            correct: 3,
            explanation: "" // [cite: 1462]
        },
        {
            level: "JCO",
            question: "ক্ষুদ্র সমন্বয় মণ্ডলে ধ্রুবতারা সহ কয়টি তারকা রয়েছে।", // [cite: 1467], [cite: 1469]
            options: ["৬।", "৭।", "৮।", "৯।"], // [cite: 1468], [cite: 1470], [cite: 1471], [cite: 1472]
            correct: 1,
            explanation: "" // [cite: 1473]
        },
        {
            level: "JCO",
            question: "মাপনী অনুযায়ী ম্যাপ কত প্রকার।", // [cite: 1475], [cite: 1481]
            options: ["০২।", "০৩।", "০৪।", "০৫।"], // [cite: 1476], [cite: 1477], [cite: 1478], [cite: 1479]
            correct: 1,
            explanation: "" // [cite: 1480]
        },
        {
            level: "JCO",
            question: "সংকেতিক চিহ্নে কয় ধরনের রং এর ব্যবহার করা হয়।", // [cite: 1483]
            options: ["০২।", "০৩।", "০৪।", "০৬।"], // [cite: 1484], [cite: 1485], [cite: 1486], [cite: 1487]
            correct: 3,
            explanation: "" // [cite: 1488]
        },
        {
            level: "JCO",
            question: "হীনায় সংবাদ সংগ্রহের উৎস কোনটি?", // [cite: 1498]
            options: ["মানচিত্র।", "এয়ার ফটো।", "যুদ্ধবন্দী।", "উপরের সবকটি।"], // [cite: 1499], [cite: 1500], [cite: 1501], [cite: 1502]
            correct: 3,
            explanation: "" // [cite: 1503]
        },
        {
            level: "JCO",
            question: "লুক আউট ম্যান আগমনরত লক্ষ্যবস্তু সঠিকভাবে দেখে অধিনায়ককে বিষয়সমূহ জানাবে?", // [cite: 1505]
            options: ["আগমনের সংকেত।", "জনবল/যানবাহনের সংখ্যা।", "চলার গতি।", "উপরের সবকটি।"], // [cite: 1506], [cite: 1507], [cite: 1508], [cite: 1509]
            correct: 3,
            explanation: "" // [cite: 1510]
        },
        {
            level: "JCO",
            question: "ফার্মবেসে শত্রুর সংবাদ সংগ্রহ বা শত্রুর বিরুদ্ধে যুদ্ধাভিযান পরিচালনা করা কোন দলের কাজ?", // [cite: 1512]
            options: ["পর্যবেক্ষণ দল।", "নিরাপত্তা বা রক্ষী দল।", "রেকি/জঙ্গী টহল।", "প্রশাসনিক দল।"], // [cite: 1513], [cite: 1514], [cite: 1515], [cite: 1516]
            correct: 2,
            explanation: "" // [cite: 1517]
        },
        {
            level: "JCO",
            question: "এগজিলট্রেশনের কৌশল নিম্নের কোন অভিযানের মতই?", // [cite: 1521]
            options: ["হীনা।", "ফার্ম বেস।", "অনুপ্রবেশ।", "রেইড।"], // [cite: 1522], [cite: 1523], [cite: 1524], [cite: 1525]
            correct: 2,
            explanation: "" // [cite: 1526]
        },
        {
            level: "JCO",
            question: "নিম্নের কোনটি অস্থায়ী সড়ক প্রতিবন্ধক?", // [cite: 1528]
            options: ["কংক্রিট সিলিভার।", "ভার্টিক্যাল রেল।", "বেষ্টনী।", "উপরের সবগুলো।"], // [cite: 1529], [cite: 1530], [cite: 1531], [cite: 1532]
            correct: 3,
            explanation: "" // [cite: 1533]
        },
        {
            level: "JCO",
            question: "টহলের সময় নালা ও খাল অতিক্রমের সময় অধিনায়কের পর্যবেক্ষণের পর কতজন স্কাউট পার হবে?", // [cite: 1535]
            options: ["০১ জন।", "০২ জন।", "০৩ জন।", "০৪ জন।"], // [cite: 1536], [cite: 1537], [cite: 1538], [cite: 1539]
            correct: 2,
            explanation: "" // [cite: 1540]
        },
        {
            level: "JCO",
            question: "হীনা পরিচালনায় পূর্বে পর্যবেক্ষণ করা হলে স্পটারের কাছ থেকে সর্বশেষ পরিস্থিতি জেনে নেয়া হয়।", // [cite: 1542], [cite: 1543], [cite: 1553]
            options: ["চূড়ান্ত মিলনস্থলে।", "স্পটারের জন্য নির্দিষ্ট মিলন স্থলে।", "যাত্রা পথে।", "লক্ষ্য বস্তুর নিকটে।"], // [cite: 1544], [cite: 1545], [cite: 1546], [cite: 1547]
            correct: 1,
            explanation: "" // [cite: 1548]
        },
        {
            level: "JCO",
            question: "অভিযানের ক্ষেত্রে সেকশন কর্তৃক শত্রুর এল এম জি বাঁধা অপসারণের জন্য আদর্শ সময় কতক্ষণ?", // [cite: 1554]
            options: ["১০ মিনিট।", "১৫ মিনিট।", "২০ মিনিট।", "কোনটিই নহে।"], // [cite: 1555], [cite: 1556], [cite: 1557], [cite: 1558]
            correct: 0,
            explanation: "" // [cite: 1559]
        },
        {
            level: "JCO",
            question: "ধরণ অনুযায়ী আক্রমণ কত প্রকার?", // [cite: 1561]
            options: ["২ প্রকার।", "৩ প্রকার।", "৪ প্রকার।", "৫ প্রকার।"], // [cite: 1562], [cite: 1563], [cite: 1564], [cite: 1565]
            correct: 3,
            explanation: "" // [cite: 1566]
        },
        {
            level: "JCO",
            question: "একজন প্রশিক্ষিত সৈনিকের অন্ধকার রাতে ১০০ গজ যেতে কত সময় লাগে?", // [cite: 1570]
            options: ["০১ মিনিট।", "০২ মিনিট।", "০৩ মিনিট।", "০৪ মিনিট।"], // [cite: 1571], [cite: 1572], [cite: 1573], [cite: 1574]
            correct: 2,
            explanation: "" // [cite: 1575]
        },
        {
            level: "JCO",
            question: "কোন পদ্ধতি ব্যবহার করে কাঁটাতারের বাঁধা অতিক্রম করা যায় না?", // [cite: 1577]
            options: ["মই।", "গ্রাউন্ডিং সিট এবং কম্বল।", "ধোঁয়া আবরণ।", "ব্যাঙ্গালোর টরপেডো।"], // [cite: 1578], [cite: 1579], [cite: 1580], [cite: 1581]
            correct: 2,
            explanation: "" // [cite: 1582]
        },
        {
            level: "JCO",
            question: "আক্রমণের সময় হামলা রেখা সাধারণত শত্রুর অবস্থান হতে কত দূরে নির্ধারণ করা হয়?", // [cite: 1584]
            options: ["২০০-৩০০ গজ।", "৩০০-৫০০ গজ।", "২০০-৪০০ গজ।", "৩০০-৪০০ গজ।"], // [cite: 1585], [cite: 1586], [cite: 1587], [cite: 1588]
            correct: 3,
            explanation: "" // [cite: 1589]
        },
        {
            level: "JCO",
            question: "নিয়ন্ত্রণ বিন্দু কয় অঙ্কের সংখ্যা দিয়ে প্রকাশ করা হয়?", // [cite: 1591]
            options: ["এক অঙ্কের।", "দুই অঙ্কের।", "তিন অঙ্কের।", "চার অঙ্কের।"], // [cite: 1592], [cite: 1593], [cite: 1594], [cite: 1595]
            correct: 2,
            explanation: "" // [cite: 1596]
        },
        {
            level: "JCO",
            question: "অভিযানের সময় শত্রুর গোলাগুলি করতে শুরু করলে সাধারণত কেউ কত গজের বেশি দৌড়াবে না?", // [cite: 1598]
            options: ["০৫ গজ।", "১০ গজ।", "১৫ গজ।", "২০ গজ।"], // [cite: 1599], [cite: 1600], [cite: 1601], [cite: 1602]
            correct: 3,
            explanation: "" // [cite: 1603]
        },
        {
            level: "JCO",
            question: "কোম্পানি অধিনায়ক আকাশকে পর্যবেক্ষণ করার জন্য একজন আকাশ প্রহরী নিয়োগ করে থাকে?", // [cite: 1610]
            options: ["০ ডিগ্রী থেকে ১২০ ডিগ্রী।", "১২০ ডিগ্রী থেকে ২৪০ ডিগ্রী।", "২৪০ ডিগ্রী থেকে ৩৬০ ডিগ্রী।", "উপরের সবকটি।"], // [cite: 1611], [cite: 1612], [cite: 1613], [cite: 1614]
            correct: 3,
            explanation: "" // [cite: 1615]
        },
        {
            level: "JCO",
            question: "সম্প্রসারিত প্রতিরক্ষার ক্ষেত্রে গভীরতা কীভাবে অর্জন করা হয়?", // [cite: 1617]
            options: ["মাইন ফিল্ড স্থাপনের মাধ্যমে।", "প্রতিরক্ষা ফায়ারের মাধ্যমে।", "বিকল্প অবস্থান দখলের মাধ্যমে।", "পর পর কয়েকটি প্রস্তুতকৃত অবস্থান দখলের মাধ্যমে।"], // [cite: 1618], [cite: 1619], [cite: 1620], [cite: 1621]
            correct: 3,
            explanation: "" // [cite: 1622]
        },
        {
            level: "JCO",
            question: "রণকৌশলগত পুর্নমোতায়নে প্লাটুন পরীক্ষা স্থল স্থাপনের দায়িত্ব কার?", // [cite: 1624]
            options: ["আরএল নম্বর।", "গভীরের সেকশনের উপ-অধিনায়ক।", "প্লাটুন সার্জেন্ট।", "এলএমজি গ্রুপ।"], // [cite: 1625], [cite: 1626], [cite: 1627], [cite: 1628]
            correct: 0,
            explanation: "" // [cite: 1629]
        },
        {
            level: "JCO",
            question: "রণকৌশলগত পুর্নমোতায়নে প্লাটুন মিলনস্থানে নিরাপত্তার দায়িত্বে কে থাকে?", // [cite: 1631]
            options: ["গভীরের সেকশন।", "গভীর সেকশনের এলএমজি গ্রুপ।", "আরএল নম্বর ২।", "একজন সিনিয়র সৈনিক।"], // [cite: 1632], [cite: 1633], [cite: 1634], [cite: 1635]
            correct: 1,
            explanation: "" // [cite: 1636]
        },
        {
            level: "JCO",
            question: "কোনটি রণকৌশলগত পুর্নমোতায়নের প্রত্যক্ষ নিয়ন্ত্রণ ব্যবস্থা নয়?", // [cite: 1638]
            options: ["পরীক্ষা স্থল।", "মিলনস্থান।", "বাটিং।", "আরোহন স্থান।"], // [cite: 1639], [cite: 1640], [cite: 1641], [cite: 1642]
            correct: 2,
            explanation: "" // [cite: 1643]
        },
        {
            level: "JCO",
            question: "কোনটি যুদ্ধের সময় সর্বাপেক্ষা নির্ভরযোগ্য যোগাযোগ ব্যবস্থা?", // [cite: 1648]
            options: ["টেলিফোন যোগাযোগ।", "আলোর সংকেত।", "বেতার যোগাযোগ।", "বাহক।"], // [cite: 1649], [cite: 1650], [cite: 1651], [cite: 1652]
            correct: 3,
            explanation: "" // [cite: 1653]
        },
        {
            level: "JCO",
            question: "প্রোটেক্টিভ মাইন ফিল্ড প্রতিরক্ষা অবস্থানের কত দূরত্বের মধ্যে লাগানো হয়?", // [cite: 1655]
            options: ["২০০ গজ।", "৩০০ গজ।", "৫০০ গজ।"], // [cite: 1656], [cite: 1657], [cite: 1658]
            correct: 1,
            explanation: "" // [cite: 1659]
        },
        {
            level: "JCO",
            question: "কোম্পানি উপ-অধিনায়কের অধীনে প্লাটুনকে কোম্পানি এলাকায় নিয়ে যাওয়ার দায়িত্ব কার উপর বর্তায়?", // [cite: 1661]
            options: ["সেকশন অধিনায়ক।", "প্লাটুন সার্জেন্ট।", "সেকশন উপ-অধিনায়ক।", "প্লাটুন কমান্ডার।"], // [cite: 1662], [cite: 1663], [cite: 1664], [cite: 1665]
            correct: 1,
            explanation: "" // [cite: 1666]
        },
        {
            level: "JCO",
            question: "প্রতিরক্ষায় সেকশন এলাকায় পরিখা চিহ্নিত এবং পাল্লা কার্ড করার দায়িত্ব কার?", // [cite: 1668]
            options: ["সেকশন উপ-অধিনায়ক।", "স্ব স্ব অস্ত্র দলের।", "প্লাটুন কমান্ডার।", "সেকশন কমান্ডার।"], // [cite: 1669], [cite: 1670], [cite: 1671], [cite: 1672]
            correct: 3,
            explanation: "" // [cite: 1673]
        },
        {
            level: "JCO",
            question: "প্রস্তুতি ও প্রকারভেদ অনুসারে শত্রুর সংস্পর্শে না থাকলে নিজ পছন্দমতো স্থানে প্রস্তুত করা প্রতিরক্ষা অবস্থানকে কি বলা হয়?", // [cite: 1675]
            options: ["তড়িঘড়ি প্রতিরক্ষা।", "সুপরিকল্পিত প্রতিরক্ষা।", "সংগঠিত চতুর্মুখী প্রতিরক্ষা।", "অবস্থিগত চতুর্মুখী প্রতিরক্ষা।"], // [cite: 1676], [cite: 1677], [cite: 1678], [cite: 1679]
            correct: 1,
            explanation: "" // [cite: 1680]
        },
        {
            level: "JCO",
            question: "প্লাটুন ও সেকশনের অস্ত্র স্থাপন এবং তদারকী এর দায়িত্ব কার উপর বর্তায়?", // [cite: 1683]
            options: ["সেকশন অধিনায়ক।", "প্লাটুন অধিনায়ক।", "সেকশন উপ-অধিনায়ক।", "প্লাটুন সার্জেন্ট।"], // [cite: 1684], [cite: 1685], [cite: 1686], [cite: 1687]
            correct: 1,
            explanation: "" // [cite: 1688]
        },
        {
            level: "JCO",
            question: "প্রতিরক্ষায় বিমান আক্রমণের সংকেতে কি করণীয়?", // [cite: 1690]
            options: ["আড়েন সন্ধানে দ্রুত দৌড়া দৌড়ি করা।", "চিৎকার করে সবাইকে সজাগ করা।", "খোলা জায়গায় থাকলে তৎক্ষণাৎ ভূমিতে শুয়ে পড়া।", "সেকশন কমান্ডারকে জানানো।"], // [cite: 1691], [cite: 1692], [cite: 1693], [cite: 1694]
            correct: 2,
            explanation: "" // [cite: 1695]
        },
        {
            level: "JCO",
            question: "প্লাটুন অবস্থানে কোন সমর্থনকারী অস্ত্র মোতায়েন থাকলে উক্ত অস্ত্রের স্থানীয় নিরাপত্তা কে নিশ্চিত করেন?", // [cite: 1697]
            options: ["সমর্থনকারী অস্ত্র উপদল নিজে।", "প্লাটুন কমান্ডার।", "কোম্পানি কমান্ডার।"], // [cite: 1698], [cite: 1699], [cite: 1700]
            correct: 1,
            explanation: "" // [cite: 1701]
        },
        {
            level: "JCO",
            question: "প্রতিরক্ষার মরিচার সামনে যে দূরত্বের মধ্যে কাঁটা তারের বেড়া তৈরি করা হয় গজ?", // [cite: 1703]
            options: ["৫০ গজ।", "১০০ গজ।", "৩০০ গজ।"], // [cite: 1704], [cite: 1705], [cite: 1706]
            correct: 0,
            explanation: "" // [cite: 1707]
        },
        {
            level: "JCO",
            question: "প্রতিরক্ষায় 'স্ট্যান্ড টু' এর সময় প্লাটুন কমান্ডার কিছু বিষয় অবশ্যই পরিদর্শন করবেন এক্ষেত্রে নিছের কোনটি সঠিক?", // [cite: 1709]
            options: ["অস্ত্রের ফায়ার পরিধি।", "পাল্লা নির্দেশিকা ও এলএমজি পরিধি।", "যোগাযোগ ব্যবস্থা।", "উপরের সবগুলো।"], // [cite: 1710], [cite: 1711], [cite: 1712], [cite: 1713]
            correct: 3,
            explanation: "" // [cite: 1714]
        },
        {
            level: "JCO",
            question: "স্বাভাবিক পরিস্থিতিতে একটি পদাতিক ব্যাটালিয়ন কত সময়ের মধ্যে প্রতিরক্ষা অবস্থান প্রস্তুত করতে পারে?", // [cite: 1717]
            options: ["৩৬-৭২ ঘণ্টা।", "৩৬-৪৮ ঘণ্টা।", "৪৮-৭২ ঘণ্টা।"], // [cite: 1718], [cite: 1719], [cite: 1720]
            correct: 1,
            explanation: "" // [cite: 1721]
        },
        {
            level: "JCO",
            question: "স্বাভাবিক পরিস্থিতিতে প্রতিরক্ষায় একটি সেকশন এর মূল অবস্থান খনন এর জন্য কতক্ষণ সময় লাগে?", // [cite: 1723]
            options: ["৩ ঘণ্টা।", "৪ ঘণ্টা।", "৫ ঘণ্টা।", "৬ ঘণ্টা।"], // [cite: 1724], [cite: 1725], [cite: 1726], [cite: 1727]
            correct: 3,
            explanation: "" // [cite: 1728]
        },
        {
            level: "JCO",
            question: "প্রতিরক্ষায় যুদ্ধের সময় প্লাটুনের গোলাবারুদ সরবরাহ করা কার দায়িত্ব?", // [cite: 1730]
            options: ["প্লাটুন কমান্ডার।", "কোম্পানি সার্জেন্ট মেজর।", "প্লাটুন সার্জেন্ট।"], // [cite: 1731], [cite: 1732], [cite: 1733]
            correct: 2,
            explanation: "" // [cite: 1734]
        },
        {
            level: "JCO",
            question: "প্লাটুন ছাড় কেন্দ্র থেকে সেকশনের সদস্যগণ কার নেতৃত্বে প্রতিরক্ষা এলাকায় গমন করবে?", // [cite: 1736]
            options: ["সেকশন গাইড।", "প্লাটুন গাইড।", "সেকশন অধিনায়ক।", "ক অথবা গ।"], // [cite: 1737], [cite: 1738], [cite: 1739], [cite: 1740]
            correct: 3,
            explanation: "" // [cite: 1741]
        },
        {
            level: "JCO",
            question: "কোনটি প্রতিরক্ষায় সেকশন অধিনায়কের যোগাযোগ মাধ্যম নয়?", // [cite: 1743]
            options: ["বেতার।", "আলোর সংকেত।", "বাহক।", "কণ্ঠস্বর।"], // [cite: 1744], [cite: 1745], [cite: 1746], [cite: 1747]
            correct: 0,
            explanation: "" // [cite: 1748]
        }
    ];


let player = {};
let selectedQuestions = [];
let current = 0;
let score = 0;
let timer;
let Time = 15;
let hasAnswered = false;

let correctSound = document.getElementById("correctSound");
let wrongSound = document.getElementById("wrongSound");

// INITIALIZATION & CONNECTION CHECK
window.onload = async () => {
    try {
        const response = await fetch("/api/status");
        if (response.ok) {
            const data = await response.json();
            if (data.isVisible && data.categories.length > 0) {
                document.getElementById("loadingOfflinePage").style.display = "none";
                const catDropdown = document.getElementById("playerCategory");
                catDropdown.innerHTML = '<option value="">ক্যাটাগরি নির্ধারণ করুন</option>';
                data.categories.forEach(cat => {
                    catDropdown.innerHTML += `<option value="${cat.code}">${cat.name}</option>`;
                });
                document.getElementById("startPage").style.display = "block";
            } else {
                document.getElementById("loadingOfflinePage").innerHTML = "<h1>Mission Offline</h1><p>Quiz is currently not available or no categories are active.</p>";
            }
        } else {
            throw new Error("Server error");
        }
    } catch (e) {
        document.getElementById("loadingOfflinePage").innerHTML = "<h1>Error</h1><p>Could not connect to server.</p>";
        console.warn("API error: ", e);
    }
};

async function attemptStartMission() {
    const errorEl = document.getElementById("passwordError");
    const categoryCode = document.getElementById("playerCategory").value;
    const password = document.getElementById("quizPasswordInput").value;
    const pName = document.getElementById("playerName").value.trim();
    const pID = document.getElementById("playerID").value.trim();

    if (!pName || !pID || !categoryCode) {
        errorEl.innerText = "দয়া করে নাম, আইডি এবং ক্যাটাগরি পূরণ করুন। (Fill Name, ID and Category)";
        return;
    }
    if (!password) {
        errorEl.innerText = "Please enter the access code for this category.";
        return;
    }

    errorEl.innerText = "Verifying access code...";

    try {
        const response = await fetch("/api/verify", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({ categoryCode, password })
        });

        if (response.ok) {
            const data = await response.json();
            if (data.success) {
                errorEl.innerText = "";
                startQuiz(); // Correct access code, launch quiz!
                return;
            }
        }

        const errData = await response.json().catch(() => ({}));
        errorEl.innerText = errData.error || "Incorrect password for this category.";

    } catch (e) {
        console.warn(e);
        errorEl.innerText = "API Error. Check network connection.";
    }
}

// START QUIZ
function startQuiz() {
    player.name = document.getElementById("playerName").value;
    player.id = document.getElementById("playerID").value;
    player.category = document.getElementById("playerCategory").value || "N/A";

    document.getElementById("startPage").style.display = "none";
    document.getElementById("quizPage").style.display = "block";

    document.getElementById("playerInfo").innerText =
        `Name: ${player.name} | ID: ${player.id} | Category: ${player.category}`;

    // Select questions based on category
    let questionsToUse;
    if (player.category === "NCO_Course") {
        questionsToUse = NCOCourseQuestions;
    } else if (player.category === "JCO_Course") {
        questionsToUse = JCOCourseQuestions;
    } else if (player.category === "SNK") {
        questionsToUse = SNKCourseQuestions;
    }

    selectedQuestions = shuffleArray([...questionsToUse]).slice(0, 20);

    current = 0;
    score = 0;

    loadQuestion();
}

// LOAD QUESTION
function loadQuestion() {
    let q = selectedQuestions[current];
    hasAnswered = false;

    document.getElementById("question").innerText = q.question;
    document.getElementById("progress").innerText =
        `Question: ${current + 1} / ${selectedQuestions.length}`;

    let optionsHTML = "";
    q.options.forEach((opt, index) => {
        optionsHTML += `<div class="option" onclick="selectAnswer(${index})">${opt}</div>`;
    });

    document.getElementById("options").innerHTML = optionsHTML;
    document.getElementById("result").innerText = "";

    startTimer();
}

// SELECT ANSWER
function selectAnswer(choice) {
    if (hasAnswered) {
        return;
    }
    hasAnswered = true;

    clearInterval(timer);
    let q = selectedQuestions[current];
    let options = document.querySelectorAll(".option");

    options.forEach((opt, index) => {
        if (index === q.correct) {
            opt.classList.add("correct");
        } else if (index === choice) {
            opt.classList.add("wrong");
        }
    });

    if (choice === q.correct) {
        score++;
        if (correctSound) {
            correctSound.play().catch(() => { });
        }
        document.getElementById("result").innerText =
            "✅ Correct! " + q.explanation;
    } else {
        if (wrongSound) {
            wrongSound.play().catch(() => { });
        }
        document.getElementById("result").innerText =
            "❌ Wrong! " + q.explanation;
    }

    document.getElementById("score").innerText = "Score: " + score;
}

// NEXT QUESTION
function nextQuestion() {
    current++;
    if (current >= selectedQuestions.length) {
        endQuiz();
        return;
    }
    loadQuestion();
}

// TIMER
function startTimer() {
    time = Time;
    const timerEl = document.getElementById("timer");
    timerEl.classList.remove("low-time");
    timerEl.innerText = "Time: " + time;

    timer = setInterval(() => {
        time--;
        timerEl.innerText = "Time: " + time;

        if (time <= 3) {
            timerEl.classList.add("low-time");
        }

        if (time <= 0) {
            clearInterval(timer);
            hasAnswered = true;
            document.getElementById("result").innerText = "⏱ Time Up!";
        }
    }, 1000);
}


// END QUIZ
async function endQuiz() {
    clearInterval(timer);
    document.getElementById("quizPage").style.display = "none";
    document.getElementById("leaderboardPage").style.display = "block";
    document.getElementById("leaderboard").innerHTML = "<p>Submitting score...</p>";
    await updateLeaderboard();
}

function renderLeaderboard(scoresData) {
    let html = "<h3>Top 5 Scores</h3><ol>";
    if (scoresData && scoresData.length > 0) {
        scoresData.forEach(p => {
            html += `<li>${p.name} (${p.category}) - ${p.score}</li>`;
        });
    } else {
        html += "<li>No scores yet</li>";
    }
    html += "</ol>";

    document.getElementById("leaderboard").innerHTML = html;
}

// LEADERBOARD
async function updateLeaderboard() {
    try {
        const res = await fetch("/api/scores", {
            method: "POST",
            headers: { "Content-Type": "application/json" },
            body: JSON.stringify({
                action: "submit",
                name: player.name,
                id: player.id,
                category: player.category,
                score: score
            })
        });
        const data = await res.json();
        if (data.success && data.topScores) {
            renderLeaderboard(data.topScores);
        } else {
            document.getElementById("leaderboard").innerHTML = "<p>Error loading leaderboard</p>";
        }
    } catch (e) {
        document.getElementById("leaderboard").innerHTML = "<p>Network error while saving score</p>";
    }
}

// RESTART
function restartQuiz() {
    location.reload();
}

// SHUFFLE
function shuffleArray(array) {
    for (let i = array.length - 1; i > 0; i--) {
        let j = Math.floor(Math.random() * (i + 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
    return array;
}
